Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/adc.h
/* -------- ADC_SEQR1 : (ADC Offset: 0x08) (R/W 32) Channel Sequence Register 1 -------- */
#define ADC_SEQR1_USCH1_Pos                   _UINT32_(0)                                          /* (ADC_SEQR1) User Sequence Number 1 Position */
#define ADC_SEQR1_USCH1_Msk                   (_UINT32_(0xF) << ADC_SEQR1_USCH1_Pos)               /* (ADC_SEQR1) User Sequence Number 1 Mask */
#define ADC_SEQR1_USCH1(value)                (ADC_SEQR1_USCH1_Msk & (_UINT32_(value) << ADC_SEQR1_USCH1_Pos)) /* Assigment of value for USCH1 in the ADC_SEQR1 register */
#define ADC_SEQR1_USCH2_Pos                   _UINT32_(4)                                          /* (ADC_SEQR1) User Sequence Number 2 Position */
#define ADC_SEQR1_USCH2_Msk                   (_UINT32_(0xF) << ADC_SEQR1_USCH2_Pos)               /* (ADC_SEQR1) User Sequence Number 2 Mask */
#define ADC_SEQR1_USCH2(value)                (ADC_SEQR1_USCH2_Msk & (_UINT32_(value) << ADC_SEQR1_USCH2_Pos)) /* Assigment of value for USCH2 in the ADC_SEQR1 register */
#define ADC_SEQR1_USCH3_Pos                   _UINT32_(8)                                          /* (ADC_SEQR1) User Sequence Number 3 Position */
#define ADC_SEQR1_USCH3_Msk                   (_UINT32_(0xF) << ADC_SEQR1_USCH3_Pos)               /* (ADC_SEQR1) User Sequence Number 3 Mask */
#define ADC_SEQR1_USCH3(value)                (ADC_SEQR1_USCH3_Msk & (_UINT32_(value) << ADC_SEQR1_USCH3_Pos)) /* Assigment of value for USCH3 in the ADC_SEQR1 register */
#define ADC_SEQR1_USCH4_Pos                   _UINT32_(12)                                         /* (ADC_SEQR1) User Sequence Number 4 Position */
#define ADC_SEQR1_USCH4_Msk                   (_UINT32_(0xF) << ADC_SEQR1_USCH4_Pos)               /* (ADC_SEQR1) User Sequence Number 4 Mask */
#define ADC_SEQR1_USCH4(value)                (ADC_SEQR1_USCH4_Msk & (_UINT32_(value) << ADC_SEQR1_USCH4_Pos)) /* Assigment of value for USCH4 in the ADC_SEQR1 register */
#define ADC_SEQR1_USCH5_Pos                   _UINT32_(16)                                         /* (ADC_SEQR1) User Sequence Number 5 Position */
#define ADC_SEQR1_USCH5_Msk                   (_UINT32_(0xF) << ADC_SEQR1_USCH5_Pos)               /* (ADC_SEQR1) User Sequence Number 5 Mask */
#define ADC_SEQR1_USCH5(value)                (ADC_SEQR1_USCH5_Msk & (_UINT32_(value) << ADC_SEQR1_USCH5_Pos)) /* Assigment of value for USCH5 in the ADC_SEQR1 register */
#define ADC_SEQR1_USCH6_Pos                   _UINT32_(20)                                         /* (ADC_SEQR1) User Sequence Number 6 Position */
#define ADC_SEQR1_USCH6_Msk                   (_UINT32_(0xF) << ADC_SEQR1_USCH6_Pos)               /* (ADC_SEQR1) User Sequence Number 6 Mask */
#define ADC_SEQR1_USCH6(value)                (ADC_SEQR1_USCH6_Msk & (_UINT32_(value) << ADC_SEQR1_USCH6_Pos)) /* Assigment of value for USCH6 in the ADC_SEQR1 register */
#define ADC_SEQR1_USCH7_Pos                   _UINT32_(24)                                         /* (ADC_SEQR1) User Sequence Number 7 Position */
#define ADC_SEQR1_USCH7_Msk                   (_UINT32_(0xF) << ADC_SEQR1_USCH7_Pos)               /* (ADC_SEQR1) User Sequence Number 7 Mask */
#define ADC_SEQR1_USCH7(value)                (ADC_SEQR1_USCH7_Msk & (_UINT32_(value) << ADC_SEQR1_USCH7_Pos)) /* Assigment of value for USCH7 in the ADC_SEQR1 register */
#define ADC_SEQR1_USCH8_Pos                   _UINT32_(28)                                         /* (ADC_SEQR1) User Sequence Number 8 Position */
#define ADC_SEQR1_USCH8_Msk                   (_UINT32_(0xF) << ADC_SEQR1_USCH8_Pos)               /* (ADC_SEQR1) User Sequence Number 8 Mask */
#define ADC_SEQR1_USCH8(value)                (ADC_SEQR1_USCH8_Msk & (_UINT32_(value) << ADC_SEQR1_USCH8_Pos)) /* Assigment of value for USCH8 in the ADC_SEQR1 register */
#define ADC_SEQR1_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (ADC_SEQR1) Register Mask  */


/* -------- ADC_SEQR2 : (ADC Offset: 0x0C) (R/W 32) Channel Sequence Register 2 -------- */
#define ADC_SEQR2_USCH9_Pos                   _UINT32_(0)                                          /* (ADC_SEQR2) User Sequence Number 9 Position */
#define ADC_SEQR2_USCH9_Msk                   (_UINT32_(0xF) << ADC_SEQR2_USCH9_Pos)               /* (ADC_SEQR2) User Sequence Number 9 Mask */
#define ADC_SEQR2_USCH9(value)                (ADC_SEQR2_USCH9_Msk & (_UINT32_(value) << ADC_SEQR2_USCH9_Pos)) /* Assigment of value for USCH9 in the ADC_SEQR2 register */
#define ADC_SEQR2_USCH10_Pos                  _UINT32_(4)                                          /* (ADC_SEQR2) User Sequence Number 10 Position */
#define ADC_SEQR2_USCH10_Msk                  (_UINT32_(0xF) << ADC_SEQR2_USCH10_Pos)              /* (ADC_SEQR2) User Sequence Number 10 Mask */
#define ADC_SEQR2_USCH10(value)               (ADC_SEQR2_USCH10_Msk & (_UINT32_(value) << ADC_SEQR2_USCH10_Pos)) /* Assigment of value for USCH10 in the ADC_SEQR2 register */
#define ADC_SEQR2_USCH11_Pos                  _UINT32_(8)                                          /* (ADC_SEQR2) User Sequence Number 11 Position */
#define ADC_SEQR2_USCH11_Msk                  (_UINT32_(0xF) << ADC_SEQR2_USCH11_Pos)              /* (ADC_SEQR2) User Sequence Number 11 Mask */
#define ADC_SEQR2_USCH11(value)               (ADC_SEQR2_USCH11_Msk & (_UINT32_(value) << ADC_SEQR2_USCH11_Pos)) /* Assigment of value for USCH11 in the ADC_SEQR2 register */
#define ADC_SEQR2_USCH12_Pos                  _UINT32_(12)                                         /* (ADC_SEQR2) User Sequence Number 12 Position */
#define ADC_SEQR2_USCH12_Msk                  (_UINT32_(0xF) << ADC_SEQR2_USCH12_Pos)              /* (ADC_SEQR2) User Sequence Number 12 Mask */
#define ADC_SEQR2_USCH12(value)               (ADC_SEQR2_USCH12_Msk & (_UINT32_(value) << ADC_SEQR2_USCH12_Pos)) /* Assigment of value for USCH12 in the ADC_SEQR2 register */
#define ADC_SEQR2_USCH13_Pos                  _UINT32_(16)                                         /* (ADC_SEQR2) User Sequence Number 13 Position */
#define ADC_SEQR2_USCH13_Msk                  (_UINT32_(0xF) << ADC_SEQR2_USCH13_Pos)              /* (ADC_SEQR2) User Sequence Number 13 Mask */
#define ADC_SEQR2_USCH13(value)               (ADC_SEQR2_USCH13_Msk & (_UINT32_(value) << ADC_SEQR2_USCH13_Pos)) /* Assigment of value for USCH13 in the ADC_SEQR2 register */
#define ADC_SEQR2_USCH14_Pos                  _UINT32_(20)                                         /* (ADC_SEQR2) User Sequence Number 14 Position */
#define ADC_SEQR2_USCH14_Msk                  (_UINT32_(0xF) << ADC_SEQR2_USCH14_Pos)              /* (ADC_SEQR2) User Sequence Number 14 Mask */
#define ADC_SEQR2_USCH14(value)               (ADC_SEQR2_USCH14_Msk & (_UINT32_(value) << ADC_SEQR2_USCH14_Pos)) /* Assigment of value for USCH14 in the ADC_SEQR2 register */
#define ADC_SEQR2_USCH15_Pos                  _UINT32_(24)                                         /* (ADC_SEQR2) User Sequence Number 15 Position */
#define ADC_SEQR2_USCH15_Msk                  (_UINT32_(0xF) << ADC_SEQR2_USCH15_Pos)              /* (ADC_SEQR2) User Sequence Number 15 Mask */
#define ADC_SEQR2_USCH15(value)               (ADC_SEQR2_USCH15_Msk & (_UINT32_(value) << ADC_SEQR2_USCH15_Pos)) /* Assigment of value for USCH15 in the ADC_SEQR2 register */
#define ADC_SEQR2_USCH16_Pos                  _UINT32_(28)                                         /* (ADC_SEQR2) User Sequence Number 16 Position */
#define ADC_SEQR2_USCH16_Msk                  (_UINT32_(0xF) << ADC_SEQR2_USCH16_Pos)              /* (ADC_SEQR2) User Sequence Number 16 Mask */
#define ADC_SEQR2_USCH16(value)               (ADC_SEQR2_USCH16_Msk & (_UINT32_(value) << ADC_SEQR2_USCH16_Pos)) /* Assigment of value for USCH16 in the ADC_SEQR2 register */
#define ADC_SEQR2_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (ADC_SEQR2) Register Mask  */


