Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/adc.h
/* -------- ADC_CHER : (ADC Offset: 0x10) ( /W 32) Channel Enable Register -------- */
#define ADC_CHER_CH0_Pos                      _UINT32_(0)                                          /* (ADC_CHER) Channel 0 Enable Position */
#define ADC_CHER_CH0_Msk                      (_UINT32_(0x1) << ADC_CHER_CH0_Pos)                  /* (ADC_CHER) Channel 0 Enable Mask */
#define ADC_CHER_CH0(value)                   (ADC_CHER_CH0_Msk & (_UINT32_(value) << ADC_CHER_CH0_Pos)) /* Assigment of value for CH0 in the ADC_CHER register */
#define ADC_CHER_CH1_Pos                      _UINT32_(1)                                          /* (ADC_CHER) Channel 1 Enable Position */
#define ADC_CHER_CH1_Msk                      (_UINT32_(0x1) << ADC_CHER_CH1_Pos)                  /* (ADC_CHER) Channel 1 Enable Mask */
#define ADC_CHER_CH1(value)                   (ADC_CHER_CH1_Msk & (_UINT32_(value) << ADC_CHER_CH1_Pos)) /* Assigment of value for CH1 in the ADC_CHER register */
#define ADC_CHER_CH2_Pos                      _UINT32_(2)                                          /* (ADC_CHER) Channel 2 Enable Position */
#define ADC_CHER_CH2_Msk                      (_UINT32_(0x1) << ADC_CHER_CH2_Pos)                  /* (ADC_CHER) Channel 2 Enable Mask */
#define ADC_CHER_CH2(value)                   (ADC_CHER_CH2_Msk & (_UINT32_(value) << ADC_CHER_CH2_Pos)) /* Assigment of value for CH2 in the ADC_CHER register */
#define ADC_CHER_CH3_Pos                      _UINT32_(3)                                          /* (ADC_CHER) Channel 3 Enable Position */
#define ADC_CHER_CH3_Msk                      (_UINT32_(0x1) << ADC_CHER_CH3_Pos)                  /* (ADC_CHER) Channel 3 Enable Mask */
#define ADC_CHER_CH3(value)                   (ADC_CHER_CH3_Msk & (_UINT32_(value) << ADC_CHER_CH3_Pos)) /* Assigment of value for CH3 in the ADC_CHER register */
#define ADC_CHER_CH4_Pos                      _UINT32_(4)                                          /* (ADC_CHER) Channel 4 Enable Position */
#define ADC_CHER_CH4_Msk                      (_UINT32_(0x1) << ADC_CHER_CH4_Pos)                  /* (ADC_CHER) Channel 4 Enable Mask */
#define ADC_CHER_CH4(value)                   (ADC_CHER_CH4_Msk & (_UINT32_(value) << ADC_CHER_CH4_Pos)) /* Assigment of value for CH4 in the ADC_CHER register */
#define ADC_CHER_CH5_Pos                      _UINT32_(5)                                          /* (ADC_CHER) Channel 5 Enable Position */
#define ADC_CHER_CH5_Msk                      (_UINT32_(0x1) << ADC_CHER_CH5_Pos)                  /* (ADC_CHER) Channel 5 Enable Mask */
#define ADC_CHER_CH5(value)                   (ADC_CHER_CH5_Msk & (_UINT32_(value) << ADC_CHER_CH5_Pos)) /* Assigment of value for CH5 in the ADC_CHER register */
#define ADC_CHER_CH6_Pos                      _UINT32_(6)                                          /* (ADC_CHER) Channel 6 Enable Position */
#define ADC_CHER_CH6_Msk                      (_UINT32_(0x1) << ADC_CHER_CH6_Pos)                  /* (ADC_CHER) Channel 6 Enable Mask */
#define ADC_CHER_CH6(value)                   (ADC_CHER_CH6_Msk & (_UINT32_(value) << ADC_CHER_CH6_Pos)) /* Assigment of value for CH6 in the ADC_CHER register */
#define ADC_CHER_CH7_Pos                      _UINT32_(7)                                          /* (ADC_CHER) Channel 7 Enable Position */
#define ADC_CHER_CH7_Msk                      (_UINT32_(0x1) << ADC_CHER_CH7_Pos)                  /* (ADC_CHER) Channel 7 Enable Mask */
#define ADC_CHER_CH7(value)                   (ADC_CHER_CH7_Msk & (_UINT32_(value) << ADC_CHER_CH7_Pos)) /* Assigment of value for CH7 in the ADC_CHER register */
#define ADC_CHER_CH8_Pos                      _UINT32_(8)                                          /* (ADC_CHER) Channel 8 Enable Position */
#define ADC_CHER_CH8_Msk                      (_UINT32_(0x1) << ADC_CHER_CH8_Pos)                  /* (ADC_CHER) Channel 8 Enable Mask */
#define ADC_CHER_CH8(value)                   (ADC_CHER_CH8_Msk & (_UINT32_(value) << ADC_CHER_CH8_Pos)) /* Assigment of value for CH8 in the ADC_CHER register */
#define ADC_CHER_CH9_Pos                      _UINT32_(9)                                          /* (ADC_CHER) Channel 9 Enable Position */
#define ADC_CHER_CH9_Msk                      (_UINT32_(0x1) << ADC_CHER_CH9_Pos)                  /* (ADC_CHER) Channel 9 Enable Mask */
#define ADC_CHER_CH9(value)                   (ADC_CHER_CH9_Msk & (_UINT32_(value) << ADC_CHER_CH9_Pos)) /* Assigment of value for CH9 in the ADC_CHER register */
#define ADC_CHER_CH10_Pos                     _UINT32_(10)                                         /* (ADC_CHER) Channel 10 Enable Position */
#define ADC_CHER_CH10_Msk                     (_UINT32_(0x1) << ADC_CHER_CH10_Pos)                 /* (ADC_CHER) Channel 10 Enable Mask */
#define ADC_CHER_CH10(value)                  (ADC_CHER_CH10_Msk & (_UINT32_(value) << ADC_CHER_CH10_Pos)) /* Assigment of value for CH10 in the ADC_CHER register */
#define ADC_CHER_CH11_Pos                     _UINT32_(11)                                         /* (ADC_CHER) Channel 11 Enable Position */
#define ADC_CHER_CH11_Msk                     (_UINT32_(0x1) << ADC_CHER_CH11_Pos)                 /* (ADC_CHER) Channel 11 Enable Mask */
#define ADC_CHER_CH11(value)                  (ADC_CHER_CH11_Msk & (_UINT32_(value) << ADC_CHER_CH11_Pos)) /* Assigment of value for CH11 in the ADC_CHER register */
#define ADC_CHER_CH12_Pos                     _UINT32_(12)                                         /* (ADC_CHER) Channel 12 Enable Position */
#define ADC_CHER_CH12_Msk                     (_UINT32_(0x1) << ADC_CHER_CH12_Pos)                 /* (ADC_CHER) Channel 12 Enable Mask */
#define ADC_CHER_CH12(value)                  (ADC_CHER_CH12_Msk & (_UINT32_(value) << ADC_CHER_CH12_Pos)) /* Assigment of value for CH12 in the ADC_CHER register */
#define ADC_CHER_CH13_Pos                     _UINT32_(13)                                         /* (ADC_CHER) Channel 13 Enable Position */
#define ADC_CHER_CH13_Msk                     (_UINT32_(0x1) << ADC_CHER_CH13_Pos)                 /* (ADC_CHER) Channel 13 Enable Mask */
#define ADC_CHER_CH13(value)                  (ADC_CHER_CH13_Msk & (_UINT32_(value) << ADC_CHER_CH13_Pos)) /* Assigment of value for CH13 in the ADC_CHER register */
#define ADC_CHER_CH14_Pos                     _UINT32_(14)                                         /* (ADC_CHER) Channel 14 Enable Position */
#define ADC_CHER_CH14_Msk                     (_UINT32_(0x1) << ADC_CHER_CH14_Pos)                 /* (ADC_CHER) Channel 14 Enable Mask */
#define ADC_CHER_CH14(value)                  (ADC_CHER_CH14_Msk & (_UINT32_(value) << ADC_CHER_CH14_Pos)) /* Assigment of value for CH14 in the ADC_CHER register */
#define ADC_CHER_CH15_Pos                     _UINT32_(15)                                         /* (ADC_CHER) Channel 15 Enable Position */
#define ADC_CHER_CH15_Msk                     (_UINT32_(0x1) << ADC_CHER_CH15_Pos)                 /* (ADC_CHER) Channel 15 Enable Mask */
#define ADC_CHER_CH15(value)                  (ADC_CHER_CH15_Msk & (_UINT32_(value) << ADC_CHER_CH15_Pos)) /* Assigment of value for CH15 in the ADC_CHER register */
#define ADC_CHER_Msk                          _UINT32_(0x0000FFFF)                                 /* (ADC_CHER) Register Mask  */

