Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/adc.h
#define ADC_CHER_CH_Pos                       _UINT32_(0)                                          /* (ADC_CHER Position) Channel x5 Enable */
#define ADC_CHER_CH_Msk                       (_UINT32_(0xFFFF) << ADC_CHER_CH_Pos)                /* (ADC_CHER Mask) CH */
#define ADC_CHER_CH(value)                    (ADC_CHER_CH_Msk & (_UINT32_(value) << ADC_CHER_CH_Pos)) 

/* -------- ADC_CHDR : (ADC Offset: 0x14) ( /W 32) Channel Disable Register -------- */
#define ADC_CHDR_CH0_Pos                      _UINT32_(0)                                          /* (ADC_CHDR) Channel 0 Disable Position */
#define ADC_CHDR_CH0_Msk                      (_UINT32_(0x1) << ADC_CHDR_CH0_Pos)                  /* (ADC_CHDR) Channel 0 Disable Mask */
#define ADC_CHDR_CH0(value)                   (ADC_CHDR_CH0_Msk & (_UINT32_(value) << ADC_CHDR_CH0_Pos)) /* Assigment of value for CH0 in the ADC_CHDR register */
#define ADC_CHDR_CH1_Pos                      _UINT32_(1)                                          /* (ADC_CHDR) Channel 1 Disable Position */
#define ADC_CHDR_CH1_Msk                      (_UINT32_(0x1) << ADC_CHDR_CH1_Pos)                  /* (ADC_CHDR) Channel 1 Disable Mask */
#define ADC_CHDR_CH1(value)                   (ADC_CHDR_CH1_Msk & (_UINT32_(value) << ADC_CHDR_CH1_Pos)) /* Assigment of value for CH1 in the ADC_CHDR register */
#define ADC_CHDR_CH2_Pos                      _UINT32_(2)                                          /* (ADC_CHDR) Channel 2 Disable Position */
#define ADC_CHDR_CH2_Msk                      (_UINT32_(0x1) << ADC_CHDR_CH2_Pos)                  /* (ADC_CHDR) Channel 2 Disable Mask */
#define ADC_CHDR_CH2(value)                   (ADC_CHDR_CH2_Msk & (_UINT32_(value) << ADC_CHDR_CH2_Pos)) /* Assigment of value for CH2 in the ADC_CHDR register */
#define ADC_CHDR_CH3_Pos                      _UINT32_(3)                                          /* (ADC_CHDR) Channel 3 Disable Position */
#define ADC_CHDR_CH3_Msk                      (_UINT32_(0x1) << ADC_CHDR_CH3_Pos)                  /* (ADC_CHDR) Channel 3 Disable Mask */
#define ADC_CHDR_CH3(value)                   (ADC_CHDR_CH3_Msk & (_UINT32_(value) << ADC_CHDR_CH3_Pos)) /* Assigment of value for CH3 in the ADC_CHDR register */
#define ADC_CHDR_CH4_Pos                      _UINT32_(4)                                          /* (ADC_CHDR) Channel 4 Disable Position */
#define ADC_CHDR_CH4_Msk                      (_UINT32_(0x1) << ADC_CHDR_CH4_Pos)                  /* (ADC_CHDR) Channel 4 Disable Mask */
#define ADC_CHDR_CH4(value)                   (ADC_CHDR_CH4_Msk & (_UINT32_(value) << ADC_CHDR_CH4_Pos)) /* Assigment of value for CH4 in the ADC_CHDR register */
#define ADC_CHDR_CH5_Pos                      _UINT32_(5)                                          /* (ADC_CHDR) Channel 5 Disable Position */
#define ADC_CHDR_CH5_Msk                      (_UINT32_(0x1) << ADC_CHDR_CH5_Pos)                  /* (ADC_CHDR) Channel 5 Disable Mask */
#define ADC_CHDR_CH5(value)                   (ADC_CHDR_CH5_Msk & (_UINT32_(value) << ADC_CHDR_CH5_Pos)) /* Assigment of value for CH5 in the ADC_CHDR register */
#define ADC_CHDR_CH6_Pos                      _UINT32_(6)                                          /* (ADC_CHDR) Channel 6 Disable Position */
#define ADC_CHDR_CH6_Msk                      (_UINT32_(0x1) << ADC_CHDR_CH6_Pos)                  /* (ADC_CHDR) Channel 6 Disable Mask */
#define ADC_CHDR_CH6(value)                   (ADC_CHDR_CH6_Msk & (_UINT32_(value) << ADC_CHDR_CH6_Pos)) /* Assigment of value for CH6 in the ADC_CHDR register */
#define ADC_CHDR_CH7_Pos                      _UINT32_(7)                                          /* (ADC_CHDR) Channel 7 Disable Position */
#define ADC_CHDR_CH7_Msk                      (_UINT32_(0x1) << ADC_CHDR_CH7_Pos)                  /* (ADC_CHDR) Channel 7 Disable Mask */
#define ADC_CHDR_CH7(value)                   (ADC_CHDR_CH7_Msk & (_UINT32_(value) << ADC_CHDR_CH7_Pos)) /* Assigment of value for CH7 in the ADC_CHDR register */
#define ADC_CHDR_CH8_Pos                      _UINT32_(8)                                          /* (ADC_CHDR) Channel 8 Disable Position */
#define ADC_CHDR_CH8_Msk                      (_UINT32_(0x1) << ADC_CHDR_CH8_Pos)                  /* (ADC_CHDR) Channel 8 Disable Mask */
#define ADC_CHDR_CH8(value)                   (ADC_CHDR_CH8_Msk & (_UINT32_(value) << ADC_CHDR_CH8_Pos)) /* Assigment of value for CH8 in the ADC_CHDR register */
#define ADC_CHDR_CH9_Pos                      _UINT32_(9)                                          /* (ADC_CHDR) Channel 9 Disable Position */
#define ADC_CHDR_CH9_Msk                      (_UINT32_(0x1) << ADC_CHDR_CH9_Pos)                  /* (ADC_CHDR) Channel 9 Disable Mask */
#define ADC_CHDR_CH9(value)                   (ADC_CHDR_CH9_Msk & (_UINT32_(value) << ADC_CHDR_CH9_Pos)) /* Assigment of value for CH9 in the ADC_CHDR register */
#define ADC_CHDR_CH10_Pos                     _UINT32_(10)                                         /* (ADC_CHDR) Channel 10 Disable Position */
#define ADC_CHDR_CH10_Msk                     (_UINT32_(0x1) << ADC_CHDR_CH10_Pos)                 /* (ADC_CHDR) Channel 10 Disable Mask */
#define ADC_CHDR_CH10(value)                  (ADC_CHDR_CH10_Msk & (_UINT32_(value) << ADC_CHDR_CH10_Pos)) /* Assigment of value for CH10 in the ADC_CHDR register */
#define ADC_CHDR_CH11_Pos                     _UINT32_(11)                                         /* (ADC_CHDR) Channel 11 Disable Position */
#define ADC_CHDR_CH11_Msk                     (_UINT32_(0x1) << ADC_CHDR_CH11_Pos)                 /* (ADC_CHDR) Channel 11 Disable Mask */
#define ADC_CHDR_CH11(value)                  (ADC_CHDR_CH11_Msk & (_UINT32_(value) << ADC_CHDR_CH11_Pos)) /* Assigment of value for CH11 in the ADC_CHDR register */
#define ADC_CHDR_CH12_Pos                     _UINT32_(12)                                         /* (ADC_CHDR) Channel 12 Disable Position */
#define ADC_CHDR_CH12_Msk                     (_UINT32_(0x1) << ADC_CHDR_CH12_Pos)                 /* (ADC_CHDR) Channel 12 Disable Mask */
#define ADC_CHDR_CH12(value)                  (ADC_CHDR_CH12_Msk & (_UINT32_(value) << ADC_CHDR_CH12_Pos)) /* Assigment of value for CH12 in the ADC_CHDR register */
#define ADC_CHDR_CH13_Pos                     _UINT32_(13)                                         /* (ADC_CHDR) Channel 13 Disable Position */
#define ADC_CHDR_CH13_Msk                     (_UINT32_(0x1) << ADC_CHDR_CH13_Pos)                 /* (ADC_CHDR) Channel 13 Disable Mask */
#define ADC_CHDR_CH13(value)                  (ADC_CHDR_CH13_Msk & (_UINT32_(value) << ADC_CHDR_CH13_Pos)) /* Assigment of value for CH13 in the ADC_CHDR register */
#define ADC_CHDR_CH14_Pos                     _UINT32_(14)                                         /* (ADC_CHDR) Channel 14 Disable Position */
#define ADC_CHDR_CH14_Msk                     (_UINT32_(0x1) << ADC_CHDR_CH14_Pos)                 /* (ADC_CHDR) Channel 14 Disable Mask */
#define ADC_CHDR_CH14(value)                  (ADC_CHDR_CH14_Msk & (_UINT32_(value) << ADC_CHDR_CH14_Pos)) /* Assigment of value for CH14 in the ADC_CHDR register */
#define ADC_CHDR_CH15_Pos                     _UINT32_(15)                                         /* (ADC_CHDR) Channel 15 Disable Position */
#define ADC_CHDR_CH15_Msk                     (_UINT32_(0x1) << ADC_CHDR_CH15_Pos)                 /* (ADC_CHDR) Channel 15 Disable Mask */
#define ADC_CHDR_CH15(value)                  (ADC_CHDR_CH15_Msk & (_UINT32_(value) << ADC_CHDR_CH15_Pos)) /* Assigment of value for CH15 in the ADC_CHDR register */
#define ADC_CHDR_Msk                          _UINT32_(0x0000FFFF)                                 /* (ADC_CHDR) Register Mask  */

#define ADC_CHDR_CH_Pos                       _UINT32_(0)                                          /* (ADC_CHDR Position) Channel x5 Disable */
#define ADC_CHDR_CH_Msk                       (_UINT32_(0xFFFF) << ADC_CHDR_CH_Pos)                /* (ADC_CHDR Mask) CH */
#define ADC_CHDR_CH(value)                    (ADC_CHDR_CH_Msk & (_UINT32_(value) << ADC_CHDR_CH_Pos)) 

