Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/adc.h
/* -------- ADC_CHSR : (ADC Offset: 0x18) ( R/ 32) Channel Status Register -------- */
#define ADC_CHSR_CH0_Pos                      _UINT32_(0)                                          /* (ADC_CHSR) Channel 0 Status Position */
#define ADC_CHSR_CH0_Msk                      (_UINT32_(0x1) << ADC_CHSR_CH0_Pos)                  /* (ADC_CHSR) Channel 0 Status Mask */
#define ADC_CHSR_CH0(value)                   (ADC_CHSR_CH0_Msk & (_UINT32_(value) << ADC_CHSR_CH0_Pos)) /* Assigment of value for CH0 in the ADC_CHSR register */
#define ADC_CHSR_CH1_Pos                      _UINT32_(1)                                          /* (ADC_CHSR) Channel 1 Status Position */
#define ADC_CHSR_CH1_Msk                      (_UINT32_(0x1) << ADC_CHSR_CH1_Pos)                  /* (ADC_CHSR) Channel 1 Status Mask */
#define ADC_CHSR_CH1(value)                   (ADC_CHSR_CH1_Msk & (_UINT32_(value) << ADC_CHSR_CH1_Pos)) /* Assigment of value for CH1 in the ADC_CHSR register */
#define ADC_CHSR_CH2_Pos                      _UINT32_(2)                                          /* (ADC_CHSR) Channel 2 Status Position */
#define ADC_CHSR_CH2_Msk                      (_UINT32_(0x1) << ADC_CHSR_CH2_Pos)                  /* (ADC_CHSR) Channel 2 Status Mask */
#define ADC_CHSR_CH2(value)                   (ADC_CHSR_CH2_Msk & (_UINT32_(value) << ADC_CHSR_CH2_Pos)) /* Assigment of value for CH2 in the ADC_CHSR register */
#define ADC_CHSR_CH3_Pos                      _UINT32_(3)                                          /* (ADC_CHSR) Channel 3 Status Position */
#define ADC_CHSR_CH3_Msk                      (_UINT32_(0x1) << ADC_CHSR_CH3_Pos)                  /* (ADC_CHSR) Channel 3 Status Mask */
#define ADC_CHSR_CH3(value)                   (ADC_CHSR_CH3_Msk & (_UINT32_(value) << ADC_CHSR_CH3_Pos)) /* Assigment of value for CH3 in the ADC_CHSR register */
#define ADC_CHSR_CH4_Pos                      _UINT32_(4)                                          /* (ADC_CHSR) Channel 4 Status Position */
#define ADC_CHSR_CH4_Msk                      (_UINT32_(0x1) << ADC_CHSR_CH4_Pos)                  /* (ADC_CHSR) Channel 4 Status Mask */
#define ADC_CHSR_CH4(value)                   (ADC_CHSR_CH4_Msk & (_UINT32_(value) << ADC_CHSR_CH4_Pos)) /* Assigment of value for CH4 in the ADC_CHSR register */
#define ADC_CHSR_CH5_Pos                      _UINT32_(5)                                          /* (ADC_CHSR) Channel 5 Status Position */
#define ADC_CHSR_CH5_Msk                      (_UINT32_(0x1) << ADC_CHSR_CH5_Pos)                  /* (ADC_CHSR) Channel 5 Status Mask */
#define ADC_CHSR_CH5(value)                   (ADC_CHSR_CH5_Msk & (_UINT32_(value) << ADC_CHSR_CH5_Pos)) /* Assigment of value for CH5 in the ADC_CHSR register */
#define ADC_CHSR_CH6_Pos                      _UINT32_(6)                                          /* (ADC_CHSR) Channel 6 Status Position */
#define ADC_CHSR_CH6_Msk                      (_UINT32_(0x1) << ADC_CHSR_CH6_Pos)                  /* (ADC_CHSR) Channel 6 Status Mask */
#define ADC_CHSR_CH6(value)                   (ADC_CHSR_CH6_Msk & (_UINT32_(value) << ADC_CHSR_CH6_Pos)) /* Assigment of value for CH6 in the ADC_CHSR register */
#define ADC_CHSR_CH7_Pos                      _UINT32_(7)                                          /* (ADC_CHSR) Channel 7 Status Position */
#define ADC_CHSR_CH7_Msk                      (_UINT32_(0x1) << ADC_CHSR_CH7_Pos)                  /* (ADC_CHSR) Channel 7 Status Mask */
#define ADC_CHSR_CH7(value)                   (ADC_CHSR_CH7_Msk & (_UINT32_(value) << ADC_CHSR_CH7_Pos)) /* Assigment of value for CH7 in the ADC_CHSR register */
#define ADC_CHSR_CH8_Pos                      _UINT32_(8)                                          /* (ADC_CHSR) Channel 8 Status Position */
#define ADC_CHSR_CH8_Msk                      (_UINT32_(0x1) << ADC_CHSR_CH8_Pos)                  /* (ADC_CHSR) Channel 8 Status Mask */
#define ADC_CHSR_CH8(value)                   (ADC_CHSR_CH8_Msk & (_UINT32_(value) << ADC_CHSR_CH8_Pos)) /* Assigment of value for CH8 in the ADC_CHSR register */
#define ADC_CHSR_CH9_Pos                      _UINT32_(9)                                          /* (ADC_CHSR) Channel 9 Status Position */
#define ADC_CHSR_CH9_Msk                      (_UINT32_(0x1) << ADC_CHSR_CH9_Pos)                  /* (ADC_CHSR) Channel 9 Status Mask */
#define ADC_CHSR_CH9(value)                   (ADC_CHSR_CH9_Msk & (_UINT32_(value) << ADC_CHSR_CH9_Pos)) /* Assigment of value for CH9 in the ADC_CHSR register */
#define ADC_CHSR_CH10_Pos                     _UINT32_(10)                                         /* (ADC_CHSR) Channel 10 Status Position */
#define ADC_CHSR_CH10_Msk                     (_UINT32_(0x1) << ADC_CHSR_CH10_Pos)                 /* (ADC_CHSR) Channel 10 Status Mask */
#define ADC_CHSR_CH10(value)                  (ADC_CHSR_CH10_Msk & (_UINT32_(value) << ADC_CHSR_CH10_Pos)) /* Assigment of value for CH10 in the ADC_CHSR register */
#define ADC_CHSR_CH11_Pos                     _UINT32_(11)                                         /* (ADC_CHSR) Channel 11 Status Position */
#define ADC_CHSR_CH11_Msk                     (_UINT32_(0x1) << ADC_CHSR_CH11_Pos)                 /* (ADC_CHSR) Channel 11 Status Mask */
#define ADC_CHSR_CH11(value)                  (ADC_CHSR_CH11_Msk & (_UINT32_(value) << ADC_CHSR_CH11_Pos)) /* Assigment of value for CH11 in the ADC_CHSR register */
#define ADC_CHSR_CH12_Pos                     _UINT32_(12)                                         /* (ADC_CHSR) Channel 12 Status Position */
#define ADC_CHSR_CH12_Msk                     (_UINT32_(0x1) << ADC_CHSR_CH12_Pos)                 /* (ADC_CHSR) Channel 12 Status Mask */
#define ADC_CHSR_CH12(value)                  (ADC_CHSR_CH12_Msk & (_UINT32_(value) << ADC_CHSR_CH12_Pos)) /* Assigment of value for CH12 in the ADC_CHSR register */
#define ADC_CHSR_CH13_Pos                     _UINT32_(13)                                         /* (ADC_CHSR) Channel 13 Status Position */
#define ADC_CHSR_CH13_Msk                     (_UINT32_(0x1) << ADC_CHSR_CH13_Pos)                 /* (ADC_CHSR) Channel 13 Status Mask */
#define ADC_CHSR_CH13(value)                  (ADC_CHSR_CH13_Msk & (_UINT32_(value) << ADC_CHSR_CH13_Pos)) /* Assigment of value for CH13 in the ADC_CHSR register */
#define ADC_CHSR_CH14_Pos                     _UINT32_(14)                                         /* (ADC_CHSR) Channel 14 Status Position */
#define ADC_CHSR_CH14_Msk                     (_UINT32_(0x1) << ADC_CHSR_CH14_Pos)                 /* (ADC_CHSR) Channel 14 Status Mask */
#define ADC_CHSR_CH14(value)                  (ADC_CHSR_CH14_Msk & (_UINT32_(value) << ADC_CHSR_CH14_Pos)) /* Assigment of value for CH14 in the ADC_CHSR register */
#define ADC_CHSR_CH15_Pos                     _UINT32_(15)                                         /* (ADC_CHSR) Channel 15 Status Position */
#define ADC_CHSR_CH15_Msk                     (_UINT32_(0x1) << ADC_CHSR_CH15_Pos)                 /* (ADC_CHSR) Channel 15 Status Mask */
#define ADC_CHSR_CH15(value)                  (ADC_CHSR_CH15_Msk & (_UINT32_(value) << ADC_CHSR_CH15_Pos)) /* Assigment of value for CH15 in the ADC_CHSR register */
#define ADC_CHSR_Msk                          _UINT32_(0x0000FFFF)                                 /* (ADC_CHSR) Register Mask  */

#define ADC_CHSR_CH_Pos                       _UINT32_(0)                                          /* (ADC_CHSR Position) Channel x5 Status */
#define ADC_CHSR_CH_Msk                       (_UINT32_(0xFFFF) << ADC_CHSR_CH_Pos)                /* (ADC_CHSR Mask) CH */
#define ADC_CHSR_CH(value)                    (ADC_CHSR_CH_Msk & (_UINT32_(value) << ADC_CHSR_CH_Pos)) 

/* -------- ADC_LCDR : (ADC Offset: 0x20) ( R/ 32) Last Converted Data Register -------- */
#define ADC_LCDR_LDATA_Pos                    _UINT32_(0)                                          /* (ADC_LCDR) Last Data Converted Position */
#define ADC_LCDR_LDATA_Msk                    (_UINT32_(0xFFFF) << ADC_LCDR_LDATA_Pos)             /* (ADC_LCDR) Last Data Converted Mask */
#define ADC_LCDR_LDATA(value)                 (ADC_LCDR_LDATA_Msk & (_UINT32_(value) << ADC_LCDR_LDATA_Pos)) /* Assigment of value for LDATA in the ADC_LCDR register */
#define ADC_LCDR_CHNBOSR_Pos                  _UINT32_(24)                                         /* (ADC_LCDR) Channel Number in Oversampling Mode Position */
#define ADC_LCDR_CHNBOSR_Msk                  (_UINT32_(0x1F) << ADC_LCDR_CHNBOSR_Pos)             /* (ADC_LCDR) Channel Number in Oversampling Mode Mask */
#define ADC_LCDR_CHNBOSR(value)               (ADC_LCDR_CHNBOSR_Msk & (_UINT32_(value) << ADC_LCDR_CHNBOSR_Pos)) /* Assigment of value for CHNBOSR in the ADC_LCDR register */
#define ADC_LCDR_Msk                          _UINT32_(0x1F00FFFF)                                 /* (ADC_LCDR) Register Mask  */


/* -------- ADC_IER : (ADC Offset: 0x24) ( /W 32) Interrupt Enable Register -------- */
#define ADC_IER_EOC0_Pos                      _UINT32_(0)                                          /* (ADC_IER) End of Conversion Interrupt Enable 0 Position */
#define ADC_IER_EOC0_Msk                      (_UINT32_(0x1) << ADC_IER_EOC0_Pos)                  /* (ADC_IER) End of Conversion Interrupt Enable 0 Mask */
#define ADC_IER_EOC0(value)                   (ADC_IER_EOC0_Msk & (_UINT32_(value) << ADC_IER_EOC0_Pos)) /* Assigment of value for EOC0 in the ADC_IER register */
#define ADC_IER_EOC1_Pos                      _UINT32_(1)                                          /* (ADC_IER) End of Conversion Interrupt Enable 1 Position */
#define ADC_IER_EOC1_Msk                      (_UINT32_(0x1) << ADC_IER_EOC1_Pos)                  /* (ADC_IER) End of Conversion Interrupt Enable 1 Mask */
#define ADC_IER_EOC1(value)                   (ADC_IER_EOC1_Msk & (_UINT32_(value) << ADC_IER_EOC1_Pos)) /* Assigment of value for EOC1 in the ADC_IER register */
#define ADC_IER_EOC2_Pos                      _UINT32_(2)                                          /* (ADC_IER) End of Conversion Interrupt Enable 2 Position */
#define ADC_IER_EOC2_Msk                      (_UINT32_(0x1) << ADC_IER_EOC2_Pos)                  /* (ADC_IER) End of Conversion Interrupt Enable 2 Mask */
#define ADC_IER_EOC2(value)                   (ADC_IER_EOC2_Msk & (_UINT32_(value) << ADC_IER_EOC2_Pos)) /* Assigment of value for EOC2 in the ADC_IER register */
#define ADC_IER_EOC3_Pos                      _UINT32_(3)                                          /* (ADC_IER) End of Conversion Interrupt Enable 3 Position */
#define ADC_IER_EOC3_Msk                      (_UINT32_(0x1) << ADC_IER_EOC3_Pos)                  /* (ADC_IER) End of Conversion Interrupt Enable 3 Mask */
#define ADC_IER_EOC3(value)                   (ADC_IER_EOC3_Msk & (_UINT32_(value) << ADC_IER_EOC3_Pos)) /* Assigment of value for EOC3 in the ADC_IER register */
#define ADC_IER_EOC4_Pos                      _UINT32_(4)                                          /* (ADC_IER) End of Conversion Interrupt Enable 4 Position */
#define ADC_IER_EOC4_Msk                      (_UINT32_(0x1) << ADC_IER_EOC4_Pos)                  /* (ADC_IER) End of Conversion Interrupt Enable 4 Mask */
#define ADC_IER_EOC4(value)                   (ADC_IER_EOC4_Msk & (_UINT32_(value) << ADC_IER_EOC4_Pos)) /* Assigment of value for EOC4 in the ADC_IER register */
#define ADC_IER_EOC5_Pos                      _UINT32_(5)                                          /* (ADC_IER) End of Conversion Interrupt Enable 5 Position */
#define ADC_IER_EOC5_Msk                      (_UINT32_(0x1) << ADC_IER_EOC5_Pos)                  /* (ADC_IER) End of Conversion Interrupt Enable 5 Mask */
#define ADC_IER_EOC5(value)                   (ADC_IER_EOC5_Msk & (_UINT32_(value) << ADC_IER_EOC5_Pos)) /* Assigment of value for EOC5 in the ADC_IER register */
#define ADC_IER_EOC6_Pos                      _UINT32_(6)                                          /* (ADC_IER) End of Conversion Interrupt Enable 6 Position */
#define ADC_IER_EOC6_Msk                      (_UINT32_(0x1) << ADC_IER_EOC6_Pos)                  /* (ADC_IER) End of Conversion Interrupt Enable 6 Mask */
#define ADC_IER_EOC6(value)                   (ADC_IER_EOC6_Msk & (_UINT32_(value) << ADC_IER_EOC6_Pos)) /* Assigment of value for EOC6 in the ADC_IER register */
#define ADC_IER_EOC7_Pos                      _UINT32_(7)                                          /* (ADC_IER) End of Conversion Interrupt Enable 7 Position */
#define ADC_IER_EOC7_Msk                      (_UINT32_(0x1) << ADC_IER_EOC7_Pos)                  /* (ADC_IER) End of Conversion Interrupt Enable 7 Mask */
#define ADC_IER_EOC7(value)                   (ADC_IER_EOC7_Msk & (_UINT32_(value) << ADC_IER_EOC7_Pos)) /* Assigment of value for EOC7 in the ADC_IER register */
#define ADC_IER_EOC8_Pos                      _UINT32_(8)                                          /* (ADC_IER) End of Conversion Interrupt Enable 8 Position */
#define ADC_IER_EOC8_Msk                      (_UINT32_(0x1) << ADC_IER_EOC8_Pos)                  /* (ADC_IER) End of Conversion Interrupt Enable 8 Mask */
#define ADC_IER_EOC8(value)                   (ADC_IER_EOC8_Msk & (_UINT32_(value) << ADC_IER_EOC8_Pos)) /* Assigment of value for EOC8 in the ADC_IER register */
#define ADC_IER_EOC9_Pos                      _UINT32_(9)                                          /* (ADC_IER) End of Conversion Interrupt Enable 9 Position */
#define ADC_IER_EOC9_Msk                      (_UINT32_(0x1) << ADC_IER_EOC9_Pos)                  /* (ADC_IER) End of Conversion Interrupt Enable 9 Mask */
#define ADC_IER_EOC9(value)                   (ADC_IER_EOC9_Msk & (_UINT32_(value) << ADC_IER_EOC9_Pos)) /* Assigment of value for EOC9 in the ADC_IER register */
#define ADC_IER_EOC10_Pos                     _UINT32_(10)                                         /* (ADC_IER) End of Conversion Interrupt Enable 10 Position */
#define ADC_IER_EOC10_Msk                     (_UINT32_(0x1) << ADC_IER_EOC10_Pos)                 /* (ADC_IER) End of Conversion Interrupt Enable 10 Mask */
#define ADC_IER_EOC10(value)                  (ADC_IER_EOC10_Msk & (_UINT32_(value) << ADC_IER_EOC10_Pos)) /* Assigment of value for EOC10 in the ADC_IER register */
#define ADC_IER_EOC11_Pos                     _UINT32_(11)                                         /* (ADC_IER) End of Conversion Interrupt Enable 11 Position */
#define ADC_IER_EOC11_Msk                     (_UINT32_(0x1) << ADC_IER_EOC11_Pos)                 /* (ADC_IER) End of Conversion Interrupt Enable 11 Mask */
#define ADC_IER_EOC11(value)                  (ADC_IER_EOC11_Msk & (_UINT32_(value) << ADC_IER_EOC11_Pos)) /* Assigment of value for EOC11 in the ADC_IER register */
#define ADC_IER_EOC12_Pos                     _UINT32_(12)                                         /* (ADC_IER) End of Conversion Interrupt Enable 12 Position */
#define ADC_IER_EOC12_Msk                     (_UINT32_(0x1) << ADC_IER_EOC12_Pos)                 /* (ADC_IER) End of Conversion Interrupt Enable 12 Mask */
#define ADC_IER_EOC12(value)                  (ADC_IER_EOC12_Msk & (_UINT32_(value) << ADC_IER_EOC12_Pos)) /* Assigment of value for EOC12 in the ADC_IER register */
#define ADC_IER_EOC13_Pos                     _UINT32_(13)                                         /* (ADC_IER) End of Conversion Interrupt Enable 13 Position */
#define ADC_IER_EOC13_Msk                     (_UINT32_(0x1) << ADC_IER_EOC13_Pos)                 /* (ADC_IER) End of Conversion Interrupt Enable 13 Mask */
#define ADC_IER_EOC13(value)                  (ADC_IER_EOC13_Msk & (_UINT32_(value) << ADC_IER_EOC13_Pos)) /* Assigment of value for EOC13 in the ADC_IER register */
#define ADC_IER_EOC14_Pos                     _UINT32_(14)                                         /* (ADC_IER) End of Conversion Interrupt Enable 14 Position */
#define ADC_IER_EOC14_Msk                     (_UINT32_(0x1) << ADC_IER_EOC14_Pos)                 /* (ADC_IER) End of Conversion Interrupt Enable 14 Mask */
#define ADC_IER_EOC14(value)                  (ADC_IER_EOC14_Msk & (_UINT32_(value) << ADC_IER_EOC14_Pos)) /* Assigment of value for EOC14 in the ADC_IER register */
#define ADC_IER_EOC15_Pos                     _UINT32_(15)                                         /* (ADC_IER) End of Conversion Interrupt Enable 15 Position */
#define ADC_IER_EOC15_Msk                     (_UINT32_(0x1) << ADC_IER_EOC15_Pos)                 /* (ADC_IER) End of Conversion Interrupt Enable 15 Mask */
#define ADC_IER_EOC15(value)                  (ADC_IER_EOC15_Msk & (_UINT32_(value) << ADC_IER_EOC15_Pos)) /* Assigment of value for EOC15 in the ADC_IER register */
#define ADC_IER_DRDY_Pos                      _UINT32_(24)                                         /* (ADC_IER) Data Ready Interrupt Enable Position */
#define ADC_IER_DRDY_Msk                      (_UINT32_(0x1) << ADC_IER_DRDY_Pos)                  /* (ADC_IER) Data Ready Interrupt Enable Mask */
#define ADC_IER_DRDY(value)                   (ADC_IER_DRDY_Msk & (_UINT32_(value) << ADC_IER_DRDY_Pos)) /* Assigment of value for DRDY in the ADC_IER register */
#define ADC_IER_GOVRE_Pos                     _UINT32_(25)                                         /* (ADC_IER) General Overrun Error Interrupt Enable Position */
#define ADC_IER_GOVRE_Msk                     (_UINT32_(0x1) << ADC_IER_GOVRE_Pos)                 /* (ADC_IER) General Overrun Error Interrupt Enable Mask */
#define ADC_IER_GOVRE(value)                  (ADC_IER_GOVRE_Msk & (_UINT32_(value) << ADC_IER_GOVRE_Pos)) /* Assigment of value for GOVRE in the ADC_IER register */
#define ADC_IER_COMPE_Pos                     _UINT32_(26)                                         /* (ADC_IER) Comparison Event Interrupt Enable Position */
#define ADC_IER_COMPE_Msk                     (_UINT32_(0x1) << ADC_IER_COMPE_Pos)                 /* (ADC_IER) Comparison Event Interrupt Enable Mask */
#define ADC_IER_COMPE(value)                  (ADC_IER_COMPE_Msk & (_UINT32_(value) << ADC_IER_COMPE_Pos)) /* Assigment of value for COMPE in the ADC_IER register */
#define ADC_IER_Msk                           _UINT32_(0x0700FFFF)                                 /* (ADC_IER) Register Mask  */

#define ADC_IER_EOC_Pos                       _UINT32_(0)                                          /* (ADC_IER Position) End of Conversion Interrupt Enable x */
#define ADC_IER_EOC_Msk                       (_UINT32_(0xFFFF) << ADC_IER_EOC_Pos)                /* (ADC_IER Mask) EOC */
#define ADC_IER_EOC(value)                    (ADC_IER_EOC_Msk & (_UINT32_(value) << ADC_IER_EOC_Pos)) 

