Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/adc.h
/* -------- ADC_IDR : (ADC Offset: 0x28) ( /W 32) Interrupt Disable Register -------- */
#define ADC_IDR_EOC0_Pos                      _UINT32_(0)                                          /* (ADC_IDR) End of Conversion Interrupt Disable 0 Position */
#define ADC_IDR_EOC0_Msk                      (_UINT32_(0x1) << ADC_IDR_EOC0_Pos)                  /* (ADC_IDR) End of Conversion Interrupt Disable 0 Mask */
#define ADC_IDR_EOC0(value)                   (ADC_IDR_EOC0_Msk & (_UINT32_(value) << ADC_IDR_EOC0_Pos)) /* Assigment of value for EOC0 in the ADC_IDR register */
#define ADC_IDR_EOC1_Pos                      _UINT32_(1)                                          /* (ADC_IDR) End of Conversion Interrupt Disable 1 Position */
#define ADC_IDR_EOC1_Msk                      (_UINT32_(0x1) << ADC_IDR_EOC1_Pos)                  /* (ADC_IDR) End of Conversion Interrupt Disable 1 Mask */
#define ADC_IDR_EOC1(value)                   (ADC_IDR_EOC1_Msk & (_UINT32_(value) << ADC_IDR_EOC1_Pos)) /* Assigment of value for EOC1 in the ADC_IDR register */
#define ADC_IDR_EOC2_Pos                      _UINT32_(2)                                          /* (ADC_IDR) End of Conversion Interrupt Disable 2 Position */
#define ADC_IDR_EOC2_Msk                      (_UINT32_(0x1) << ADC_IDR_EOC2_Pos)                  /* (ADC_IDR) End of Conversion Interrupt Disable 2 Mask */
#define ADC_IDR_EOC2(value)                   (ADC_IDR_EOC2_Msk & (_UINT32_(value) << ADC_IDR_EOC2_Pos)) /* Assigment of value for EOC2 in the ADC_IDR register */
#define ADC_IDR_EOC3_Pos                      _UINT32_(3)                                          /* (ADC_IDR) End of Conversion Interrupt Disable 3 Position */
#define ADC_IDR_EOC3_Msk                      (_UINT32_(0x1) << ADC_IDR_EOC3_Pos)                  /* (ADC_IDR) End of Conversion Interrupt Disable 3 Mask */
#define ADC_IDR_EOC3(value)                   (ADC_IDR_EOC3_Msk & (_UINT32_(value) << ADC_IDR_EOC3_Pos)) /* Assigment of value for EOC3 in the ADC_IDR register */
#define ADC_IDR_EOC4_Pos                      _UINT32_(4)                                          /* (ADC_IDR) End of Conversion Interrupt Disable 4 Position */
#define ADC_IDR_EOC4_Msk                      (_UINT32_(0x1) << ADC_IDR_EOC4_Pos)                  /* (ADC_IDR) End of Conversion Interrupt Disable 4 Mask */
#define ADC_IDR_EOC4(value)                   (ADC_IDR_EOC4_Msk & (_UINT32_(value) << ADC_IDR_EOC4_Pos)) /* Assigment of value for EOC4 in the ADC_IDR register */
#define ADC_IDR_EOC5_Pos                      _UINT32_(5)                                          /* (ADC_IDR) End of Conversion Interrupt Disable 5 Position */
#define ADC_IDR_EOC5_Msk                      (_UINT32_(0x1) << ADC_IDR_EOC5_Pos)                  /* (ADC_IDR) End of Conversion Interrupt Disable 5 Mask */
#define ADC_IDR_EOC5(value)                   (ADC_IDR_EOC5_Msk & (_UINT32_(value) << ADC_IDR_EOC5_Pos)) /* Assigment of value for EOC5 in the ADC_IDR register */
#define ADC_IDR_EOC6_Pos                      _UINT32_(6)                                          /* (ADC_IDR) End of Conversion Interrupt Disable 6 Position */
#define ADC_IDR_EOC6_Msk                      (_UINT32_(0x1) << ADC_IDR_EOC6_Pos)                  /* (ADC_IDR) End of Conversion Interrupt Disable 6 Mask */
#define ADC_IDR_EOC6(value)                   (ADC_IDR_EOC6_Msk & (_UINT32_(value) << ADC_IDR_EOC6_Pos)) /* Assigment of value for EOC6 in the ADC_IDR register */
#define ADC_IDR_EOC7_Pos                      _UINT32_(7)                                          /* (ADC_IDR) End of Conversion Interrupt Disable 7 Position */
#define ADC_IDR_EOC7_Msk                      (_UINT32_(0x1) << ADC_IDR_EOC7_Pos)                  /* (ADC_IDR) End of Conversion Interrupt Disable 7 Mask */
#define ADC_IDR_EOC7(value)                   (ADC_IDR_EOC7_Msk & (_UINT32_(value) << ADC_IDR_EOC7_Pos)) /* Assigment of value for EOC7 in the ADC_IDR register */
#define ADC_IDR_EOC8_Pos                      _UINT32_(8)                                          /* (ADC_IDR) End of Conversion Interrupt Disable 8 Position */
#define ADC_IDR_EOC8_Msk                      (_UINT32_(0x1) << ADC_IDR_EOC8_Pos)                  /* (ADC_IDR) End of Conversion Interrupt Disable 8 Mask */
#define ADC_IDR_EOC8(value)                   (ADC_IDR_EOC8_Msk & (_UINT32_(value) << ADC_IDR_EOC8_Pos)) /* Assigment of value for EOC8 in the ADC_IDR register */
#define ADC_IDR_EOC9_Pos                      _UINT32_(9)                                          /* (ADC_IDR) End of Conversion Interrupt Disable 9 Position */
#define ADC_IDR_EOC9_Msk                      (_UINT32_(0x1) << ADC_IDR_EOC9_Pos)                  /* (ADC_IDR) End of Conversion Interrupt Disable 9 Mask */
#define ADC_IDR_EOC9(value)                   (ADC_IDR_EOC9_Msk & (_UINT32_(value) << ADC_IDR_EOC9_Pos)) /* Assigment of value for EOC9 in the ADC_IDR register */
#define ADC_IDR_EOC10_Pos                     _UINT32_(10)                                         /* (ADC_IDR) End of Conversion Interrupt Disable 10 Position */
#define ADC_IDR_EOC10_Msk                     (_UINT32_(0x1) << ADC_IDR_EOC10_Pos)                 /* (ADC_IDR) End of Conversion Interrupt Disable 10 Mask */
#define ADC_IDR_EOC10(value)                  (ADC_IDR_EOC10_Msk & (_UINT32_(value) << ADC_IDR_EOC10_Pos)) /* Assigment of value for EOC10 in the ADC_IDR register */
#define ADC_IDR_EOC11_Pos                     _UINT32_(11)                                         /* (ADC_IDR) End of Conversion Interrupt Disable 11 Position */
#define ADC_IDR_EOC11_Msk                     (_UINT32_(0x1) << ADC_IDR_EOC11_Pos)                 /* (ADC_IDR) End of Conversion Interrupt Disable 11 Mask */
#define ADC_IDR_EOC11(value)                  (ADC_IDR_EOC11_Msk & (_UINT32_(value) << ADC_IDR_EOC11_Pos)) /* Assigment of value for EOC11 in the ADC_IDR register */
#define ADC_IDR_EOC12_Pos                     _UINT32_(12)                                         /* (ADC_IDR) End of Conversion Interrupt Disable 12 Position */
#define ADC_IDR_EOC12_Msk                     (_UINT32_(0x1) << ADC_IDR_EOC12_Pos)                 /* (ADC_IDR) End of Conversion Interrupt Disable 12 Mask */
#define ADC_IDR_EOC12(value)                  (ADC_IDR_EOC12_Msk & (_UINT32_(value) << ADC_IDR_EOC12_Pos)) /* Assigment of value for EOC12 in the ADC_IDR register */
#define ADC_IDR_EOC13_Pos                     _UINT32_(13)                                         /* (ADC_IDR) End of Conversion Interrupt Disable 13 Position */
#define ADC_IDR_EOC13_Msk                     (_UINT32_(0x1) << ADC_IDR_EOC13_Pos)                 /* (ADC_IDR) End of Conversion Interrupt Disable 13 Mask */
#define ADC_IDR_EOC13(value)                  (ADC_IDR_EOC13_Msk & (_UINT32_(value) << ADC_IDR_EOC13_Pos)) /* Assigment of value for EOC13 in the ADC_IDR register */
#define ADC_IDR_EOC14_Pos                     _UINT32_(14)                                         /* (ADC_IDR) End of Conversion Interrupt Disable 14 Position */
#define ADC_IDR_EOC14_Msk                     (_UINT32_(0x1) << ADC_IDR_EOC14_Pos)                 /* (ADC_IDR) End of Conversion Interrupt Disable 14 Mask */
#define ADC_IDR_EOC14(value)                  (ADC_IDR_EOC14_Msk & (_UINT32_(value) << ADC_IDR_EOC14_Pos)) /* Assigment of value for EOC14 in the ADC_IDR register */
#define ADC_IDR_EOC15_Pos                     _UINT32_(15)                                         /* (ADC_IDR) End of Conversion Interrupt Disable 15 Position */
#define ADC_IDR_EOC15_Msk                     (_UINT32_(0x1) << ADC_IDR_EOC15_Pos)                 /* (ADC_IDR) End of Conversion Interrupt Disable 15 Mask */
#define ADC_IDR_EOC15(value)                  (ADC_IDR_EOC15_Msk & (_UINT32_(value) << ADC_IDR_EOC15_Pos)) /* Assigment of value for EOC15 in the ADC_IDR register */
#define ADC_IDR_DRDY_Pos                      _UINT32_(24)                                         /* (ADC_IDR) Data Ready Interrupt Disable Position */
#define ADC_IDR_DRDY_Msk                      (_UINT32_(0x1) << ADC_IDR_DRDY_Pos)                  /* (ADC_IDR) Data Ready Interrupt Disable Mask */
#define ADC_IDR_DRDY(value)                   (ADC_IDR_DRDY_Msk & (_UINT32_(value) << ADC_IDR_DRDY_Pos)) /* Assigment of value for DRDY in the ADC_IDR register */
#define ADC_IDR_GOVRE_Pos                     _UINT32_(25)                                         /* (ADC_IDR) General Overrun Error Interrupt Disable Position */
#define ADC_IDR_GOVRE_Msk                     (_UINT32_(0x1) << ADC_IDR_GOVRE_Pos)                 /* (ADC_IDR) General Overrun Error Interrupt Disable Mask */
#define ADC_IDR_GOVRE(value)                  (ADC_IDR_GOVRE_Msk & (_UINT32_(value) << ADC_IDR_GOVRE_Pos)) /* Assigment of value for GOVRE in the ADC_IDR register */
#define ADC_IDR_COMPE_Pos                     _UINT32_(26)                                         /* (ADC_IDR) Comparison Event Interrupt Disable Position */
#define ADC_IDR_COMPE_Msk                     (_UINT32_(0x1) << ADC_IDR_COMPE_Pos)                 /* (ADC_IDR) Comparison Event Interrupt Disable Mask */
#define ADC_IDR_COMPE(value)                  (ADC_IDR_COMPE_Msk & (_UINT32_(value) << ADC_IDR_COMPE_Pos)) /* Assigment of value for COMPE in the ADC_IDR register */
#define ADC_IDR_Msk                           _UINT32_(0x0700FFFF)                                 /* (ADC_IDR) Register Mask  */

#define ADC_IDR_EOC_Pos                       _UINT32_(0)                                          /* (ADC_IDR Position) End of Conversion Interrupt Disable x */
#define ADC_IDR_EOC_Msk                       (_UINT32_(0xFFFF) << ADC_IDR_EOC_Pos)                /* (ADC_IDR Mask) EOC */
#define ADC_IDR_EOC(value)                    (ADC_IDR_EOC_Msk & (_UINT32_(value) << ADC_IDR_EOC_Pos)) 

/* -------- ADC_IMR : (ADC Offset: 0x2C) ( R/ 32) Interrupt Mask Register -------- */
#define ADC_IMR_EOC0_Pos                      _UINT32_(0)                                          /* (ADC_IMR) End of Conversion Interrupt Mask 0 Position */
#define ADC_IMR_EOC0_Msk                      (_UINT32_(0x1) << ADC_IMR_EOC0_Pos)                  /* (ADC_IMR) End of Conversion Interrupt Mask 0 Mask */
#define ADC_IMR_EOC0(value)                   (ADC_IMR_EOC0_Msk & (_UINT32_(value) << ADC_IMR_EOC0_Pos)) /* Assigment of value for EOC0 in the ADC_IMR register */
#define ADC_IMR_EOC1_Pos                      _UINT32_(1)                                          /* (ADC_IMR) End of Conversion Interrupt Mask 1 Position */
#define ADC_IMR_EOC1_Msk                      (_UINT32_(0x1) << ADC_IMR_EOC1_Pos)                  /* (ADC_IMR) End of Conversion Interrupt Mask 1 Mask */
#define ADC_IMR_EOC1(value)                   (ADC_IMR_EOC1_Msk & (_UINT32_(value) << ADC_IMR_EOC1_Pos)) /* Assigment of value for EOC1 in the ADC_IMR register */
#define ADC_IMR_EOC2_Pos                      _UINT32_(2)                                          /* (ADC_IMR) End of Conversion Interrupt Mask 2 Position */
#define ADC_IMR_EOC2_Msk                      (_UINT32_(0x1) << ADC_IMR_EOC2_Pos)                  /* (ADC_IMR) End of Conversion Interrupt Mask 2 Mask */
#define ADC_IMR_EOC2(value)                   (ADC_IMR_EOC2_Msk & (_UINT32_(value) << ADC_IMR_EOC2_Pos)) /* Assigment of value for EOC2 in the ADC_IMR register */
#define ADC_IMR_EOC3_Pos                      _UINT32_(3)                                          /* (ADC_IMR) End of Conversion Interrupt Mask 3 Position */
#define ADC_IMR_EOC3_Msk                      (_UINT32_(0x1) << ADC_IMR_EOC3_Pos)                  /* (ADC_IMR) End of Conversion Interrupt Mask 3 Mask */
#define ADC_IMR_EOC3(value)                   (ADC_IMR_EOC3_Msk & (_UINT32_(value) << ADC_IMR_EOC3_Pos)) /* Assigment of value for EOC3 in the ADC_IMR register */
#define ADC_IMR_EOC4_Pos                      _UINT32_(4)                                          /* (ADC_IMR) End of Conversion Interrupt Mask 4 Position */
#define ADC_IMR_EOC4_Msk                      (_UINT32_(0x1) << ADC_IMR_EOC4_Pos)                  /* (ADC_IMR) End of Conversion Interrupt Mask 4 Mask */
#define ADC_IMR_EOC4(value)                   (ADC_IMR_EOC4_Msk & (_UINT32_(value) << ADC_IMR_EOC4_Pos)) /* Assigment of value for EOC4 in the ADC_IMR register */
#define ADC_IMR_EOC5_Pos                      _UINT32_(5)                                          /* (ADC_IMR) End of Conversion Interrupt Mask 5 Position */
#define ADC_IMR_EOC5_Msk                      (_UINT32_(0x1) << ADC_IMR_EOC5_Pos)                  /* (ADC_IMR) End of Conversion Interrupt Mask 5 Mask */
#define ADC_IMR_EOC5(value)                   (ADC_IMR_EOC5_Msk & (_UINT32_(value) << ADC_IMR_EOC5_Pos)) /* Assigment of value for EOC5 in the ADC_IMR register */
#define ADC_IMR_EOC6_Pos                      _UINT32_(6)                                          /* (ADC_IMR) End of Conversion Interrupt Mask 6 Position */
#define ADC_IMR_EOC6_Msk                      (_UINT32_(0x1) << ADC_IMR_EOC6_Pos)                  /* (ADC_IMR) End of Conversion Interrupt Mask 6 Mask */
#define ADC_IMR_EOC6(value)                   (ADC_IMR_EOC6_Msk & (_UINT32_(value) << ADC_IMR_EOC6_Pos)) /* Assigment of value for EOC6 in the ADC_IMR register */
#define ADC_IMR_EOC7_Pos                      _UINT32_(7)                                          /* (ADC_IMR) End of Conversion Interrupt Mask 7 Position */
#define ADC_IMR_EOC7_Msk                      (_UINT32_(0x1) << ADC_IMR_EOC7_Pos)                  /* (ADC_IMR) End of Conversion Interrupt Mask 7 Mask */
#define ADC_IMR_EOC7(value)                   (ADC_IMR_EOC7_Msk & (_UINT32_(value) << ADC_IMR_EOC7_Pos)) /* Assigment of value for EOC7 in the ADC_IMR register */
#define ADC_IMR_EOC8_Pos                      _UINT32_(8)                                          /* (ADC_IMR) End of Conversion Interrupt Mask 8 Position */
#define ADC_IMR_EOC8_Msk                      (_UINT32_(0x1) << ADC_IMR_EOC8_Pos)                  /* (ADC_IMR) End of Conversion Interrupt Mask 8 Mask */
#define ADC_IMR_EOC8(value)                   (ADC_IMR_EOC8_Msk & (_UINT32_(value) << ADC_IMR_EOC8_Pos)) /* Assigment of value for EOC8 in the ADC_IMR register */
#define ADC_IMR_EOC9_Pos                      _UINT32_(9)                                          /* (ADC_IMR) End of Conversion Interrupt Mask 9 Position */
#define ADC_IMR_EOC9_Msk                      (_UINT32_(0x1) << ADC_IMR_EOC9_Pos)                  /* (ADC_IMR) End of Conversion Interrupt Mask 9 Mask */
#define ADC_IMR_EOC9(value)                   (ADC_IMR_EOC9_Msk & (_UINT32_(value) << ADC_IMR_EOC9_Pos)) /* Assigment of value for EOC9 in the ADC_IMR register */
#define ADC_IMR_EOC10_Pos                     _UINT32_(10)                                         /* (ADC_IMR) End of Conversion Interrupt Mask 10 Position */
#define ADC_IMR_EOC10_Msk                     (_UINT32_(0x1) << ADC_IMR_EOC10_Pos)                 /* (ADC_IMR) End of Conversion Interrupt Mask 10 Mask */
#define ADC_IMR_EOC10(value)                  (ADC_IMR_EOC10_Msk & (_UINT32_(value) << ADC_IMR_EOC10_Pos)) /* Assigment of value for EOC10 in the ADC_IMR register */
#define ADC_IMR_EOC11_Pos                     _UINT32_(11)                                         /* (ADC_IMR) End of Conversion Interrupt Mask 11 Position */
#define ADC_IMR_EOC11_Msk                     (_UINT32_(0x1) << ADC_IMR_EOC11_Pos)                 /* (ADC_IMR) End of Conversion Interrupt Mask 11 Mask */
#define ADC_IMR_EOC11(value)                  (ADC_IMR_EOC11_Msk & (_UINT32_(value) << ADC_IMR_EOC11_Pos)) /* Assigment of value for EOC11 in the ADC_IMR register */
#define ADC_IMR_EOC12_Pos                     _UINT32_(12)                                         /* (ADC_IMR) End of Conversion Interrupt Mask 12 Position */
#define ADC_IMR_EOC12_Msk                     (_UINT32_(0x1) << ADC_IMR_EOC12_Pos)                 /* (ADC_IMR) End of Conversion Interrupt Mask 12 Mask */
#define ADC_IMR_EOC12(value)                  (ADC_IMR_EOC12_Msk & (_UINT32_(value) << ADC_IMR_EOC12_Pos)) /* Assigment of value for EOC12 in the ADC_IMR register */
#define ADC_IMR_EOC13_Pos                     _UINT32_(13)                                         /* (ADC_IMR) End of Conversion Interrupt Mask 13 Position */
#define ADC_IMR_EOC13_Msk                     (_UINT32_(0x1) << ADC_IMR_EOC13_Pos)                 /* (ADC_IMR) End of Conversion Interrupt Mask 13 Mask */
#define ADC_IMR_EOC13(value)                  (ADC_IMR_EOC13_Msk & (_UINT32_(value) << ADC_IMR_EOC13_Pos)) /* Assigment of value for EOC13 in the ADC_IMR register */
#define ADC_IMR_EOC14_Pos                     _UINT32_(14)                                         /* (ADC_IMR) End of Conversion Interrupt Mask 14 Position */
#define ADC_IMR_EOC14_Msk                     (_UINT32_(0x1) << ADC_IMR_EOC14_Pos)                 /* (ADC_IMR) End of Conversion Interrupt Mask 14 Mask */
#define ADC_IMR_EOC14(value)                  (ADC_IMR_EOC14_Msk & (_UINT32_(value) << ADC_IMR_EOC14_Pos)) /* Assigment of value for EOC14 in the ADC_IMR register */
#define ADC_IMR_EOC15_Pos                     _UINT32_(15)                                         /* (ADC_IMR) End of Conversion Interrupt Mask 15 Position */
#define ADC_IMR_EOC15_Msk                     (_UINT32_(0x1) << ADC_IMR_EOC15_Pos)                 /* (ADC_IMR) End of Conversion Interrupt Mask 15 Mask */
#define ADC_IMR_EOC15(value)                  (ADC_IMR_EOC15_Msk & (_UINT32_(value) << ADC_IMR_EOC15_Pos)) /* Assigment of value for EOC15 in the ADC_IMR register */
#define ADC_IMR_DRDY_Pos                      _UINT32_(24)                                         /* (ADC_IMR) Data Ready Interrupt Mask Position */
#define ADC_IMR_DRDY_Msk                      (_UINT32_(0x1) << ADC_IMR_DRDY_Pos)                  /* (ADC_IMR) Data Ready Interrupt Mask Mask */
#define ADC_IMR_DRDY(value)                   (ADC_IMR_DRDY_Msk & (_UINT32_(value) << ADC_IMR_DRDY_Pos)) /* Assigment of value for DRDY in the ADC_IMR register */
#define ADC_IMR_GOVRE_Pos                     _UINT32_(25)                                         /* (ADC_IMR) General Overrun Error Interrupt Mask Position */
#define ADC_IMR_GOVRE_Msk                     (_UINT32_(0x1) << ADC_IMR_GOVRE_Pos)                 /* (ADC_IMR) General Overrun Error Interrupt Mask Mask */
#define ADC_IMR_GOVRE(value)                  (ADC_IMR_GOVRE_Msk & (_UINT32_(value) << ADC_IMR_GOVRE_Pos)) /* Assigment of value for GOVRE in the ADC_IMR register */
#define ADC_IMR_COMPE_Pos                     _UINT32_(26)                                         /* (ADC_IMR) Comparison Event Interrupt Mask Position */
#define ADC_IMR_COMPE_Msk                     (_UINT32_(0x1) << ADC_IMR_COMPE_Pos)                 /* (ADC_IMR) Comparison Event Interrupt Mask Mask */
#define ADC_IMR_COMPE(value)                  (ADC_IMR_COMPE_Msk & (_UINT32_(value) << ADC_IMR_COMPE_Pos)) /* Assigment of value for COMPE in the ADC_IMR register */
#define ADC_IMR_Msk                           _UINT32_(0x0700FFFF)                                 /* (ADC_IMR) Register Mask  */

#define ADC_IMR_EOC_Pos                       _UINT32_(0)                                          /* (ADC_IMR Position) End of Conversion Interrupt Mask x */
#define ADC_IMR_EOC_Msk                       (_UINT32_(0xFFFF) << ADC_IMR_EOC_Pos)                /* (ADC_IMR Mask) EOC */
#define ADC_IMR_EOC(value)                    (ADC_IMR_EOC_Msk & (_UINT32_(value) << ADC_IMR_EOC_Pos)) 

