Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/adc.h
/* -------- ADC_ISR : (ADC Offset: 0x30) ( R/ 32) Interrupt Status Register -------- */
#define ADC_ISR_EOC0_Pos                      _UINT32_(0)                                          /* (ADC_ISR) End of Conversion 0 (automatically set / cleared) Position */
#define ADC_ISR_EOC0_Msk                      (_UINT32_(0x1) << ADC_ISR_EOC0_Pos)                  /* (ADC_ISR) End of Conversion 0 (automatically set / cleared) Mask */
#define ADC_ISR_EOC0(value)                   (ADC_ISR_EOC0_Msk & (_UINT32_(value) << ADC_ISR_EOC0_Pos)) /* Assigment of value for EOC0 in the ADC_ISR register */
#define ADC_ISR_EOC1_Pos                      _UINT32_(1)                                          /* (ADC_ISR) End of Conversion 1 (automatically set / cleared) Position */
#define ADC_ISR_EOC1_Msk                      (_UINT32_(0x1) << ADC_ISR_EOC1_Pos)                  /* (ADC_ISR) End of Conversion 1 (automatically set / cleared) Mask */
#define ADC_ISR_EOC1(value)                   (ADC_ISR_EOC1_Msk & (_UINT32_(value) << ADC_ISR_EOC1_Pos)) /* Assigment of value for EOC1 in the ADC_ISR register */
#define ADC_ISR_EOC2_Pos                      _UINT32_(2)                                          /* (ADC_ISR) End of Conversion 2 (automatically set / cleared) Position */
#define ADC_ISR_EOC2_Msk                      (_UINT32_(0x1) << ADC_ISR_EOC2_Pos)                  /* (ADC_ISR) End of Conversion 2 (automatically set / cleared) Mask */
#define ADC_ISR_EOC2(value)                   (ADC_ISR_EOC2_Msk & (_UINT32_(value) << ADC_ISR_EOC2_Pos)) /* Assigment of value for EOC2 in the ADC_ISR register */
#define ADC_ISR_EOC3_Pos                      _UINT32_(3)                                          /* (ADC_ISR) End of Conversion 3 (automatically set / cleared) Position */
#define ADC_ISR_EOC3_Msk                      (_UINT32_(0x1) << ADC_ISR_EOC3_Pos)                  /* (ADC_ISR) End of Conversion 3 (automatically set / cleared) Mask */
#define ADC_ISR_EOC3(value)                   (ADC_ISR_EOC3_Msk & (_UINT32_(value) << ADC_ISR_EOC3_Pos)) /* Assigment of value for EOC3 in the ADC_ISR register */
#define ADC_ISR_EOC4_Pos                      _UINT32_(4)                                          /* (ADC_ISR) End of Conversion 4 (automatically set / cleared) Position */
#define ADC_ISR_EOC4_Msk                      (_UINT32_(0x1) << ADC_ISR_EOC4_Pos)                  /* (ADC_ISR) End of Conversion 4 (automatically set / cleared) Mask */
#define ADC_ISR_EOC4(value)                   (ADC_ISR_EOC4_Msk & (_UINT32_(value) << ADC_ISR_EOC4_Pos)) /* Assigment of value for EOC4 in the ADC_ISR register */
#define ADC_ISR_EOC5_Pos                      _UINT32_(5)                                          /* (ADC_ISR) End of Conversion 5 (automatically set / cleared) Position */
#define ADC_ISR_EOC5_Msk                      (_UINT32_(0x1) << ADC_ISR_EOC5_Pos)                  /* (ADC_ISR) End of Conversion 5 (automatically set / cleared) Mask */
#define ADC_ISR_EOC5(value)                   (ADC_ISR_EOC5_Msk & (_UINT32_(value) << ADC_ISR_EOC5_Pos)) /* Assigment of value for EOC5 in the ADC_ISR register */
#define ADC_ISR_EOC6_Pos                      _UINT32_(6)                                          /* (ADC_ISR) End of Conversion 6 (automatically set / cleared) Position */
#define ADC_ISR_EOC6_Msk                      (_UINT32_(0x1) << ADC_ISR_EOC6_Pos)                  /* (ADC_ISR) End of Conversion 6 (automatically set / cleared) Mask */
#define ADC_ISR_EOC6(value)                   (ADC_ISR_EOC6_Msk & (_UINT32_(value) << ADC_ISR_EOC6_Pos)) /* Assigment of value for EOC6 in the ADC_ISR register */
#define ADC_ISR_EOC7_Pos                      _UINT32_(7)                                          /* (ADC_ISR) End of Conversion 7 (automatically set / cleared) Position */
#define ADC_ISR_EOC7_Msk                      (_UINT32_(0x1) << ADC_ISR_EOC7_Pos)                  /* (ADC_ISR) End of Conversion 7 (automatically set / cleared) Mask */
#define ADC_ISR_EOC7(value)                   (ADC_ISR_EOC7_Msk & (_UINT32_(value) << ADC_ISR_EOC7_Pos)) /* Assigment of value for EOC7 in the ADC_ISR register */
#define ADC_ISR_EOC8_Pos                      _UINT32_(8)                                          /* (ADC_ISR) End of Conversion 8 (automatically set / cleared) Position */
#define ADC_ISR_EOC8_Msk                      (_UINT32_(0x1) << ADC_ISR_EOC8_Pos)                  /* (ADC_ISR) End of Conversion 8 (automatically set / cleared) Mask */
#define ADC_ISR_EOC8(value)                   (ADC_ISR_EOC8_Msk & (_UINT32_(value) << ADC_ISR_EOC8_Pos)) /* Assigment of value for EOC8 in the ADC_ISR register */
#define ADC_ISR_EOC9_Pos                      _UINT32_(9)                                          /* (ADC_ISR) End of Conversion 9 (automatically set / cleared) Position */
#define ADC_ISR_EOC9_Msk                      (_UINT32_(0x1) << ADC_ISR_EOC9_Pos)                  /* (ADC_ISR) End of Conversion 9 (automatically set / cleared) Mask */
#define ADC_ISR_EOC9(value)                   (ADC_ISR_EOC9_Msk & (_UINT32_(value) << ADC_ISR_EOC9_Pos)) /* Assigment of value for EOC9 in the ADC_ISR register */
#define ADC_ISR_EOC10_Pos                     _UINT32_(10)                                         /* (ADC_ISR) End of Conversion 10 (automatically set / cleared) Position */
#define ADC_ISR_EOC10_Msk                     (_UINT32_(0x1) << ADC_ISR_EOC10_Pos)                 /* (ADC_ISR) End of Conversion 10 (automatically set / cleared) Mask */
#define ADC_ISR_EOC10(value)                  (ADC_ISR_EOC10_Msk & (_UINT32_(value) << ADC_ISR_EOC10_Pos)) /* Assigment of value for EOC10 in the ADC_ISR register */
#define ADC_ISR_EOC11_Pos                     _UINT32_(11)                                         /* (ADC_ISR) End of Conversion 11 (automatically set / cleared) Position */
#define ADC_ISR_EOC11_Msk                     (_UINT32_(0x1) << ADC_ISR_EOC11_Pos)                 /* (ADC_ISR) End of Conversion 11 (automatically set / cleared) Mask */
#define ADC_ISR_EOC11(value)                  (ADC_ISR_EOC11_Msk & (_UINT32_(value) << ADC_ISR_EOC11_Pos)) /* Assigment of value for EOC11 in the ADC_ISR register */
#define ADC_ISR_EOC12_Pos                     _UINT32_(12)                                         /* (ADC_ISR) End of Conversion 12 (automatically set / cleared) Position */
#define ADC_ISR_EOC12_Msk                     (_UINT32_(0x1) << ADC_ISR_EOC12_Pos)                 /* (ADC_ISR) End of Conversion 12 (automatically set / cleared) Mask */
#define ADC_ISR_EOC12(value)                  (ADC_ISR_EOC12_Msk & (_UINT32_(value) << ADC_ISR_EOC12_Pos)) /* Assigment of value for EOC12 in the ADC_ISR register */
#define ADC_ISR_EOC13_Pos                     _UINT32_(13)                                         /* (ADC_ISR) End of Conversion 13 (automatically set / cleared) Position */
#define ADC_ISR_EOC13_Msk                     (_UINT32_(0x1) << ADC_ISR_EOC13_Pos)                 /* (ADC_ISR) End of Conversion 13 (automatically set / cleared) Mask */
#define ADC_ISR_EOC13(value)                  (ADC_ISR_EOC13_Msk & (_UINT32_(value) << ADC_ISR_EOC13_Pos)) /* Assigment of value for EOC13 in the ADC_ISR register */
#define ADC_ISR_EOC14_Pos                     _UINT32_(14)                                         /* (ADC_ISR) End of Conversion 14 (automatically set / cleared) Position */
#define ADC_ISR_EOC14_Msk                     (_UINT32_(0x1) << ADC_ISR_EOC14_Pos)                 /* (ADC_ISR) End of Conversion 14 (automatically set / cleared) Mask */
#define ADC_ISR_EOC14(value)                  (ADC_ISR_EOC14_Msk & (_UINT32_(value) << ADC_ISR_EOC14_Pos)) /* Assigment of value for EOC14 in the ADC_ISR register */
#define ADC_ISR_EOC15_Pos                     _UINT32_(15)                                         /* (ADC_ISR) End of Conversion 15 (automatically set / cleared) Position */
#define ADC_ISR_EOC15_Msk                     (_UINT32_(0x1) << ADC_ISR_EOC15_Pos)                 /* (ADC_ISR) End of Conversion 15 (automatically set / cleared) Mask */
#define ADC_ISR_EOC15(value)                  (ADC_ISR_EOC15_Msk & (_UINT32_(value) << ADC_ISR_EOC15_Pos)) /* Assigment of value for EOC15 in the ADC_ISR register */
#define ADC_ISR_DRDY_Pos                      _UINT32_(24)                                         /* (ADC_ISR) Data Ready (automatically set / cleared) Position */
#define ADC_ISR_DRDY_Msk                      (_UINT32_(0x1) << ADC_ISR_DRDY_Pos)                  /* (ADC_ISR) Data Ready (automatically set / cleared) Mask */
#define ADC_ISR_DRDY(value)                   (ADC_ISR_DRDY_Msk & (_UINT32_(value) << ADC_ISR_DRDY_Pos)) /* Assigment of value for DRDY in the ADC_ISR register */
#define ADC_ISR_GOVRE_Pos                     _UINT32_(25)                                         /* (ADC_ISR) General Overrun Error (cleared on read) Position */
#define ADC_ISR_GOVRE_Msk                     (_UINT32_(0x1) << ADC_ISR_GOVRE_Pos)                 /* (ADC_ISR) General Overrun Error (cleared on read) Mask */
#define ADC_ISR_GOVRE(value)                  (ADC_ISR_GOVRE_Msk & (_UINT32_(value) << ADC_ISR_GOVRE_Pos)) /* Assigment of value for GOVRE in the ADC_ISR register */
#define ADC_ISR_COMPE_Pos                     _UINT32_(26)                                         /* (ADC_ISR) Comparison Event (cleared on read) Position */
#define ADC_ISR_COMPE_Msk                     (_UINT32_(0x1) << ADC_ISR_COMPE_Pos)                 /* (ADC_ISR) Comparison Event (cleared on read) Mask */
#define ADC_ISR_COMPE(value)                  (ADC_ISR_COMPE_Msk & (_UINT32_(value) << ADC_ISR_COMPE_Pos)) /* Assigment of value for COMPE in the ADC_ISR register */
#define ADC_ISR_Msk                           _UINT32_(0x0700FFFF)                                 /* (ADC_ISR) Register Mask  */

#define ADC_ISR_EOC_Pos                       _UINT32_(0)                                          /* (ADC_ISR Position) End of Conversion x (automatically set / cleared) */
#define ADC_ISR_EOC_Msk                       (_UINT32_(0xFFFF) << ADC_ISR_EOC_Pos)                /* (ADC_ISR Mask) EOC */
#define ADC_ISR_EOC(value)                    (ADC_ISR_EOC_Msk & (_UINT32_(value) << ADC_ISR_EOC_Pos)) 

