Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/adc.h
#define ADC_EMR_TRACKX_Pos                    _UINT32_(22)                                         /* (ADC_EMR Position) Tracking time x4 */
#define ADC_EMR_TRACKX_Msk                    (_UINT32_(0x1) << ADC_EMR_TRACKX_Pos)                /* (ADC_EMR Mask) TRACKX */
#define ADC_EMR_TRACKX(value)                 (ADC_EMR_TRACKX_Msk & (_UINT32_(value) << ADC_EMR_TRACKX_Pos)) 

/* -------- ADC_CWR : (ADC Offset: 0x44) (R/W 32) Compare Window Register -------- */
#define ADC_CWR_LOWTHRES_Pos                  _UINT32_(0)                                          /* (ADC_CWR) Low Threshold Position */
#define ADC_CWR_LOWTHRES_Msk                  (_UINT32_(0xFFFF) << ADC_CWR_LOWTHRES_Pos)           /* (ADC_CWR) Low Threshold Mask */
#define ADC_CWR_LOWTHRES(value)               (ADC_CWR_LOWTHRES_Msk & (_UINT32_(value) << ADC_CWR_LOWTHRES_Pos)) /* Assigment of value for LOWTHRES in the ADC_CWR register */
#define ADC_CWR_HIGHTHRES_Pos                 _UINT32_(16)                                         /* (ADC_CWR) High Threshold Position */
#define ADC_CWR_HIGHTHRES_Msk                 (_UINT32_(0xFFFF) << ADC_CWR_HIGHTHRES_Pos)          /* (ADC_CWR) High Threshold Mask */
#define ADC_CWR_HIGHTHRES(value)              (ADC_CWR_HIGHTHRES_Msk & (_UINT32_(value) << ADC_CWR_HIGHTHRES_Pos)) /* Assigment of value for HIGHTHRES in the ADC_CWR register */
#define ADC_CWR_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (ADC_CWR) Register Mask  */


/* -------- ADC_CGR : (ADC Offset: 0x48) (R/W 32) Channel Gain Register -------- */
#define ADC_CGR_GAIN0_Pos                     _UINT32_(0)                                          /* (ADC_CGR) Gain for Channel 0 Position */
#define ADC_CGR_GAIN0_Msk                     (_UINT32_(0x3) << ADC_CGR_GAIN0_Pos)                 /* (ADC_CGR) Gain for Channel 0 Mask */
#define ADC_CGR_GAIN0(value)                  (ADC_CGR_GAIN0_Msk & (_UINT32_(value) << ADC_CGR_GAIN0_Pos)) /* Assigment of value for GAIN0 in the ADC_CGR register */
#define   ADC_CGR_GAIN0_SE1_DIFF0_5_Val       _UINT32_(0x0)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN0_SE1_DIFF1_Val         _UINT32_(0x1)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN0_SE2_DIFF2_Val         _UINT32_(0x2)                                        /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN0_SE4_DIFF2_Val         _UINT32_(0x3)                                        /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define ADC_CGR_GAIN0_SE1_DIFF0_5             (ADC_CGR_GAIN0_SE1_DIFF0_5_Val << ADC_CGR_GAIN0_Pos) /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN0_SE1_DIFF1               (ADC_CGR_GAIN0_SE1_DIFF1_Val << ADC_CGR_GAIN0_Pos)   /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN0_SE2_DIFF2               (ADC_CGR_GAIN0_SE2_DIFF2_Val << ADC_CGR_GAIN0_Pos)   /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN0_SE4_DIFF2               (ADC_CGR_GAIN0_SE4_DIFF2_Val << ADC_CGR_GAIN0_Pos)   /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN1_Pos                     _UINT32_(2)                                          /* (ADC_CGR) Gain for Channel 1 Position */
#define ADC_CGR_GAIN1_Msk                     (_UINT32_(0x3) << ADC_CGR_GAIN1_Pos)                 /* (ADC_CGR) Gain for Channel 1 Mask */
#define ADC_CGR_GAIN1(value)                  (ADC_CGR_GAIN1_Msk & (_UINT32_(value) << ADC_CGR_GAIN1_Pos)) /* Assigment of value for GAIN1 in the ADC_CGR register */
#define   ADC_CGR_GAIN1_SE1_DIFF0_5_Val       _UINT32_(0x0)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN1_SE1_DIFF1_Val         _UINT32_(0x1)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN1_SE2_DIFF2_Val         _UINT32_(0x2)                                        /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN1_SE4_DIFF2_Val         _UINT32_(0x3)                                        /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define ADC_CGR_GAIN1_SE1_DIFF0_5             (ADC_CGR_GAIN1_SE1_DIFF0_5_Val << ADC_CGR_GAIN1_Pos) /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN1_SE1_DIFF1               (ADC_CGR_GAIN1_SE1_DIFF1_Val << ADC_CGR_GAIN1_Pos)   /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN1_SE2_DIFF2               (ADC_CGR_GAIN1_SE2_DIFF2_Val << ADC_CGR_GAIN1_Pos)   /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN1_SE4_DIFF2               (ADC_CGR_GAIN1_SE4_DIFF2_Val << ADC_CGR_GAIN1_Pos)   /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN2_Pos                     _UINT32_(4)                                          /* (ADC_CGR) Gain for Channel 2 Position */
#define ADC_CGR_GAIN2_Msk                     (_UINT32_(0x3) << ADC_CGR_GAIN2_Pos)                 /* (ADC_CGR) Gain for Channel 2 Mask */
#define ADC_CGR_GAIN2(value)                  (ADC_CGR_GAIN2_Msk & (_UINT32_(value) << ADC_CGR_GAIN2_Pos)) /* Assigment of value for GAIN2 in the ADC_CGR register */
#define   ADC_CGR_GAIN2_SE1_DIFF0_5_Val       _UINT32_(0x0)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN2_SE1_DIFF1_Val         _UINT32_(0x1)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN2_SE2_DIFF2_Val         _UINT32_(0x2)                                        /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN2_SE4_DIFF2_Val         _UINT32_(0x3)                                        /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define ADC_CGR_GAIN2_SE1_DIFF0_5             (ADC_CGR_GAIN2_SE1_DIFF0_5_Val << ADC_CGR_GAIN2_Pos) /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN2_SE1_DIFF1               (ADC_CGR_GAIN2_SE1_DIFF1_Val << ADC_CGR_GAIN2_Pos)   /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN2_SE2_DIFF2               (ADC_CGR_GAIN2_SE2_DIFF2_Val << ADC_CGR_GAIN2_Pos)   /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN2_SE4_DIFF2               (ADC_CGR_GAIN2_SE4_DIFF2_Val << ADC_CGR_GAIN2_Pos)   /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN3_Pos                     _UINT32_(6)                                          /* (ADC_CGR) Gain for Channel 3 Position */
#define ADC_CGR_GAIN3_Msk                     (_UINT32_(0x3) << ADC_CGR_GAIN3_Pos)                 /* (ADC_CGR) Gain for Channel 3 Mask */
#define ADC_CGR_GAIN3(value)                  (ADC_CGR_GAIN3_Msk & (_UINT32_(value) << ADC_CGR_GAIN3_Pos)) /* Assigment of value for GAIN3 in the ADC_CGR register */
#define   ADC_CGR_GAIN3_SE1_DIFF0_5_Val       _UINT32_(0x0)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN3_SE1_DIFF1_Val         _UINT32_(0x1)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN3_SE2_DIFF2_Val         _UINT32_(0x2)                                        /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN3_SE4_DIFF2_Val         _UINT32_(0x3)                                        /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define ADC_CGR_GAIN3_SE1_DIFF0_5             (ADC_CGR_GAIN3_SE1_DIFF0_5_Val << ADC_CGR_GAIN3_Pos) /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN3_SE1_DIFF1               (ADC_CGR_GAIN3_SE1_DIFF1_Val << ADC_CGR_GAIN3_Pos)   /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN3_SE2_DIFF2               (ADC_CGR_GAIN3_SE2_DIFF2_Val << ADC_CGR_GAIN3_Pos)   /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN3_SE4_DIFF2               (ADC_CGR_GAIN3_SE4_DIFF2_Val << ADC_CGR_GAIN3_Pos)   /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN4_Pos                     _UINT32_(8)                                          /* (ADC_CGR) Gain for Channel 4 Position */
#define ADC_CGR_GAIN4_Msk                     (_UINT32_(0x3) << ADC_CGR_GAIN4_Pos)                 /* (ADC_CGR) Gain for Channel 4 Mask */
#define ADC_CGR_GAIN4(value)                  (ADC_CGR_GAIN4_Msk & (_UINT32_(value) << ADC_CGR_GAIN4_Pos)) /* Assigment of value for GAIN4 in the ADC_CGR register */
#define   ADC_CGR_GAIN4_SE1_DIFF0_5_Val       _UINT32_(0x0)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN4_SE1_DIFF1_Val         _UINT32_(0x1)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN4_SE2_DIFF2_Val         _UINT32_(0x2)                                        /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN4_SE4_DIFF2_Val         _UINT32_(0x3)                                        /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define ADC_CGR_GAIN4_SE1_DIFF0_5             (ADC_CGR_GAIN4_SE1_DIFF0_5_Val << ADC_CGR_GAIN4_Pos) /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN4_SE1_DIFF1               (ADC_CGR_GAIN4_SE1_DIFF1_Val << ADC_CGR_GAIN4_Pos)   /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN4_SE2_DIFF2               (ADC_CGR_GAIN4_SE2_DIFF2_Val << ADC_CGR_GAIN4_Pos)   /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN4_SE4_DIFF2               (ADC_CGR_GAIN4_SE4_DIFF2_Val << ADC_CGR_GAIN4_Pos)   /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN5_Pos                     _UINT32_(10)                                         /* (ADC_CGR) Gain for Channel 5 Position */
#define ADC_CGR_GAIN5_Msk                     (_UINT32_(0x3) << ADC_CGR_GAIN5_Pos)                 /* (ADC_CGR) Gain for Channel 5 Mask */
#define ADC_CGR_GAIN5(value)                  (ADC_CGR_GAIN5_Msk & (_UINT32_(value) << ADC_CGR_GAIN5_Pos)) /* Assigment of value for GAIN5 in the ADC_CGR register */
#define   ADC_CGR_GAIN5_SE1_DIFF0_5_Val       _UINT32_(0x0)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN5_SE1_DIFF1_Val         _UINT32_(0x1)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN5_SE2_DIFF2_Val         _UINT32_(0x2)                                        /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN5_SE4_DIFF2_Val         _UINT32_(0x3)                                        /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define ADC_CGR_GAIN5_SE1_DIFF0_5             (ADC_CGR_GAIN5_SE1_DIFF0_5_Val << ADC_CGR_GAIN5_Pos) /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN5_SE1_DIFF1               (ADC_CGR_GAIN5_SE1_DIFF1_Val << ADC_CGR_GAIN5_Pos)   /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN5_SE2_DIFF2               (ADC_CGR_GAIN5_SE2_DIFF2_Val << ADC_CGR_GAIN5_Pos)   /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN5_SE4_DIFF2               (ADC_CGR_GAIN5_SE4_DIFF2_Val << ADC_CGR_GAIN5_Pos)   /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN6_Pos                     _UINT32_(12)                                         /* (ADC_CGR) Gain for Channel 6 Position */
#define ADC_CGR_GAIN6_Msk                     (_UINT32_(0x3) << ADC_CGR_GAIN6_Pos)                 /* (ADC_CGR) Gain for Channel 6 Mask */
#define ADC_CGR_GAIN6(value)                  (ADC_CGR_GAIN6_Msk & (_UINT32_(value) << ADC_CGR_GAIN6_Pos)) /* Assigment of value for GAIN6 in the ADC_CGR register */
#define   ADC_CGR_GAIN6_SE1_DIFF0_5_Val       _UINT32_(0x0)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN6_SE1_DIFF1_Val         _UINT32_(0x1)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN6_SE2_DIFF2_Val         _UINT32_(0x2)                                        /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN6_SE4_DIFF2_Val         _UINT32_(0x3)                                        /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define ADC_CGR_GAIN6_SE1_DIFF0_5             (ADC_CGR_GAIN6_SE1_DIFF0_5_Val << ADC_CGR_GAIN6_Pos) /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN6_SE1_DIFF1               (ADC_CGR_GAIN6_SE1_DIFF1_Val << ADC_CGR_GAIN6_Pos)   /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN6_SE2_DIFF2               (ADC_CGR_GAIN6_SE2_DIFF2_Val << ADC_CGR_GAIN6_Pos)   /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN6_SE4_DIFF2               (ADC_CGR_GAIN6_SE4_DIFF2_Val << ADC_CGR_GAIN6_Pos)   /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN7_Pos                     _UINT32_(14)                                         /* (ADC_CGR) Gain for Channel 7 Position */
#define ADC_CGR_GAIN7_Msk                     (_UINT32_(0x3) << ADC_CGR_GAIN7_Pos)                 /* (ADC_CGR) Gain for Channel 7 Mask */
#define ADC_CGR_GAIN7(value)                  (ADC_CGR_GAIN7_Msk & (_UINT32_(value) << ADC_CGR_GAIN7_Pos)) /* Assigment of value for GAIN7 in the ADC_CGR register */
#define   ADC_CGR_GAIN7_SE1_DIFF0_5_Val       _UINT32_(0x0)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN7_SE1_DIFF1_Val         _UINT32_(0x1)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN7_SE2_DIFF2_Val         _UINT32_(0x2)                                        /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN7_SE4_DIFF2_Val         _UINT32_(0x3)                                        /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define ADC_CGR_GAIN7_SE1_DIFF0_5             (ADC_CGR_GAIN7_SE1_DIFF0_5_Val << ADC_CGR_GAIN7_Pos) /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN7_SE1_DIFF1               (ADC_CGR_GAIN7_SE1_DIFF1_Val << ADC_CGR_GAIN7_Pos)   /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN7_SE2_DIFF2               (ADC_CGR_GAIN7_SE2_DIFF2_Val << ADC_CGR_GAIN7_Pos)   /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN7_SE4_DIFF2               (ADC_CGR_GAIN7_SE4_DIFF2_Val << ADC_CGR_GAIN7_Pos)   /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN8_Pos                     _UINT32_(16)                                         /* (ADC_CGR) Gain for Channel 8 Position */
#define ADC_CGR_GAIN8_Msk                     (_UINT32_(0x3) << ADC_CGR_GAIN8_Pos)                 /* (ADC_CGR) Gain for Channel 8 Mask */
#define ADC_CGR_GAIN8(value)                  (ADC_CGR_GAIN8_Msk & (_UINT32_(value) << ADC_CGR_GAIN8_Pos)) /* Assigment of value for GAIN8 in the ADC_CGR register */
#define   ADC_CGR_GAIN8_SE1_DIFF0_5_Val       _UINT32_(0x0)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN8_SE1_DIFF1_Val         _UINT32_(0x1)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN8_SE2_DIFF2_Val         _UINT32_(0x2)                                        /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN8_SE4_DIFF2_Val         _UINT32_(0x3)                                        /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define ADC_CGR_GAIN8_SE1_DIFF0_5             (ADC_CGR_GAIN8_SE1_DIFF0_5_Val << ADC_CGR_GAIN8_Pos) /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN8_SE1_DIFF1               (ADC_CGR_GAIN8_SE1_DIFF1_Val << ADC_CGR_GAIN8_Pos)   /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN8_SE2_DIFF2               (ADC_CGR_GAIN8_SE2_DIFF2_Val << ADC_CGR_GAIN8_Pos)   /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN8_SE4_DIFF2               (ADC_CGR_GAIN8_SE4_DIFF2_Val << ADC_CGR_GAIN8_Pos)   /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN9_Pos                     _UINT32_(18)                                         /* (ADC_CGR) Gain for Channel 9 Position */
#define ADC_CGR_GAIN9_Msk                     (_UINT32_(0x3) << ADC_CGR_GAIN9_Pos)                 /* (ADC_CGR) Gain for Channel 9 Mask */
#define ADC_CGR_GAIN9(value)                  (ADC_CGR_GAIN9_Msk & (_UINT32_(value) << ADC_CGR_GAIN9_Pos)) /* Assigment of value for GAIN9 in the ADC_CGR register */
#define   ADC_CGR_GAIN9_SE1_DIFF0_5_Val       _UINT32_(0x0)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN9_SE1_DIFF1_Val         _UINT32_(0x1)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN9_SE2_DIFF2_Val         _UINT32_(0x2)                                        /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN9_SE4_DIFF2_Val         _UINT32_(0x3)                                        /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define ADC_CGR_GAIN9_SE1_DIFF0_5             (ADC_CGR_GAIN9_SE1_DIFF0_5_Val << ADC_CGR_GAIN9_Pos) /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN9_SE1_DIFF1               (ADC_CGR_GAIN9_SE1_DIFF1_Val << ADC_CGR_GAIN9_Pos)   /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN9_SE2_DIFF2               (ADC_CGR_GAIN9_SE2_DIFF2_Val << ADC_CGR_GAIN9_Pos)   /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN9_SE4_DIFF2               (ADC_CGR_GAIN9_SE4_DIFF2_Val << ADC_CGR_GAIN9_Pos)   /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN10_Pos                    _UINT32_(20)                                         /* (ADC_CGR) Gain for Channel 10 Position */
#define ADC_CGR_GAIN10_Msk                    (_UINT32_(0x3) << ADC_CGR_GAIN10_Pos)                /* (ADC_CGR) Gain for Channel 10 Mask */
#define ADC_CGR_GAIN10(value)                 (ADC_CGR_GAIN10_Msk & (_UINT32_(value) << ADC_CGR_GAIN10_Pos)) /* Assigment of value for GAIN10 in the ADC_CGR register */
#define   ADC_CGR_GAIN10_SE1_DIFF0_5_Val      _UINT32_(0x0)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN10_SE1_DIFF1_Val        _UINT32_(0x1)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN10_SE2_DIFF2_Val        _UINT32_(0x2)                                        /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN10_SE4_DIFF2_Val        _UINT32_(0x3)                                        /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
