Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/adc.h
#define ADC_CGR_GAIN10_SE1_DIFF0_5            (ADC_CGR_GAIN10_SE1_DIFF0_5_Val << ADC_CGR_GAIN10_Pos) /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN10_SE1_DIFF1              (ADC_CGR_GAIN10_SE1_DIFF1_Val << ADC_CGR_GAIN10_Pos) /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN10_SE2_DIFF2              (ADC_CGR_GAIN10_SE2_DIFF2_Val << ADC_CGR_GAIN10_Pos) /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN10_SE4_DIFF2              (ADC_CGR_GAIN10_SE4_DIFF2_Val << ADC_CGR_GAIN10_Pos) /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN11_Pos                    _UINT32_(22)                                         /* (ADC_CGR) Gain for Channel 11 Position */
#define ADC_CGR_GAIN11_Msk                    (_UINT32_(0x3) << ADC_CGR_GAIN11_Pos)                /* (ADC_CGR) Gain for Channel 11 Mask */
#define ADC_CGR_GAIN11(value)                 (ADC_CGR_GAIN11_Msk & (_UINT32_(value) << ADC_CGR_GAIN11_Pos)) /* Assigment of value for GAIN11 in the ADC_CGR register */
#define   ADC_CGR_GAIN11_SE1_DIFF0_5_Val      _UINT32_(0x0)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN11_SE1_DIFF1_Val        _UINT32_(0x1)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN11_SE2_DIFF2_Val        _UINT32_(0x2)                                        /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN11_SE4_DIFF2_Val        _UINT32_(0x3)                                        /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define ADC_CGR_GAIN11_SE1_DIFF0_5            (ADC_CGR_GAIN11_SE1_DIFF0_5_Val << ADC_CGR_GAIN11_Pos) /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN11_SE1_DIFF1              (ADC_CGR_GAIN11_SE1_DIFF1_Val << ADC_CGR_GAIN11_Pos) /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN11_SE2_DIFF2              (ADC_CGR_GAIN11_SE2_DIFF2_Val << ADC_CGR_GAIN11_Pos) /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN11_SE4_DIFF2              (ADC_CGR_GAIN11_SE4_DIFF2_Val << ADC_CGR_GAIN11_Pos) /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN12_Pos                    _UINT32_(24)                                         /* (ADC_CGR) Gain for Channel 12 Position */
#define ADC_CGR_GAIN12_Msk                    (_UINT32_(0x3) << ADC_CGR_GAIN12_Pos)                /* (ADC_CGR) Gain for Channel 12 Mask */
#define ADC_CGR_GAIN12(value)                 (ADC_CGR_GAIN12_Msk & (_UINT32_(value) << ADC_CGR_GAIN12_Pos)) /* Assigment of value for GAIN12 in the ADC_CGR register */
#define   ADC_CGR_GAIN12_SE1_DIFF0_5_Val      _UINT32_(0x0)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN12_SE1_DIFF1_Val        _UINT32_(0x1)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN12_SE2_DIFF2_Val        _UINT32_(0x2)                                        /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN12_SE4_DIFF2_Val        _UINT32_(0x3)                                        /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define ADC_CGR_GAIN12_SE1_DIFF0_5            (ADC_CGR_GAIN12_SE1_DIFF0_5_Val << ADC_CGR_GAIN12_Pos) /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN12_SE1_DIFF1              (ADC_CGR_GAIN12_SE1_DIFF1_Val << ADC_CGR_GAIN12_Pos) /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN12_SE2_DIFF2              (ADC_CGR_GAIN12_SE2_DIFF2_Val << ADC_CGR_GAIN12_Pos) /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN12_SE4_DIFF2              (ADC_CGR_GAIN12_SE4_DIFF2_Val << ADC_CGR_GAIN12_Pos) /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN13_Pos                    _UINT32_(26)                                         /* (ADC_CGR) Gain for Channel 13 Position */
#define ADC_CGR_GAIN13_Msk                    (_UINT32_(0x3) << ADC_CGR_GAIN13_Pos)                /* (ADC_CGR) Gain for Channel 13 Mask */
#define ADC_CGR_GAIN13(value)                 (ADC_CGR_GAIN13_Msk & (_UINT32_(value) << ADC_CGR_GAIN13_Pos)) /* Assigment of value for GAIN13 in the ADC_CGR register */
#define   ADC_CGR_GAIN13_SE1_DIFF0_5_Val      _UINT32_(0x0)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN13_SE1_DIFF1_Val        _UINT32_(0x1)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN13_SE2_DIFF2_Val        _UINT32_(0x2)                                        /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN13_SE4_DIFF2_Val        _UINT32_(0x3)                                        /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define ADC_CGR_GAIN13_SE1_DIFF0_5            (ADC_CGR_GAIN13_SE1_DIFF0_5_Val << ADC_CGR_GAIN13_Pos) /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN13_SE1_DIFF1              (ADC_CGR_GAIN13_SE1_DIFF1_Val << ADC_CGR_GAIN13_Pos) /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN13_SE2_DIFF2              (ADC_CGR_GAIN13_SE2_DIFF2_Val << ADC_CGR_GAIN13_Pos) /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN13_SE4_DIFF2              (ADC_CGR_GAIN13_SE4_DIFF2_Val << ADC_CGR_GAIN13_Pos) /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN14_Pos                    _UINT32_(28)                                         /* (ADC_CGR) Gain for Channel 14 Position */
#define ADC_CGR_GAIN14_Msk                    (_UINT32_(0x3) << ADC_CGR_GAIN14_Pos)                /* (ADC_CGR) Gain for Channel 14 Mask */
#define ADC_CGR_GAIN14(value)                 (ADC_CGR_GAIN14_Msk & (_UINT32_(value) << ADC_CGR_GAIN14_Pos)) /* Assigment of value for GAIN14 in the ADC_CGR register */
#define   ADC_CGR_GAIN14_SE1_DIFF0_5_Val      _UINT32_(0x0)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN14_SE1_DIFF1_Val        _UINT32_(0x1)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN14_SE2_DIFF2_Val        _UINT32_(0x2)                                        /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN14_SE4_DIFF2_Val        _UINT32_(0x3)                                        /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define ADC_CGR_GAIN14_SE1_DIFF0_5            (ADC_CGR_GAIN14_SE1_DIFF0_5_Val << ADC_CGR_GAIN14_Pos) /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN14_SE1_DIFF1              (ADC_CGR_GAIN14_SE1_DIFF1_Val << ADC_CGR_GAIN14_Pos) /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN14_SE2_DIFF2              (ADC_CGR_GAIN14_SE2_DIFF2_Val << ADC_CGR_GAIN14_Pos) /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN14_SE4_DIFF2              (ADC_CGR_GAIN14_SE4_DIFF2_Val << ADC_CGR_GAIN14_Pos) /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN15_Pos                    _UINT32_(30)                                         /* (ADC_CGR) Gain for Channel 15 Position */
#define ADC_CGR_GAIN15_Msk                    (_UINT32_(0x3) << ADC_CGR_GAIN15_Pos)                /* (ADC_CGR) Gain for Channel 15 Mask */
#define ADC_CGR_GAIN15(value)                 (ADC_CGR_GAIN15_Msk & (_UINT32_(value) << ADC_CGR_GAIN15_Pos)) /* Assigment of value for GAIN15 in the ADC_CGR register */
#define   ADC_CGR_GAIN15_SE1_DIFF0_5_Val      _UINT32_(0x0)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN15_SE1_DIFF1_Val        _UINT32_(0x1)                                        /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN15_SE2_DIFF2_Val        _UINT32_(0x2)                                        /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define   ADC_CGR_GAIN15_SE4_DIFF2_Val        _UINT32_(0x3)                                        /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1)  */
#define ADC_CGR_GAIN15_SE1_DIFF0_5            (ADC_CGR_GAIN15_SE1_DIFF0_5_Val << ADC_CGR_GAIN15_Pos) /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 0.5 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN15_SE1_DIFF1              (ADC_CGR_GAIN15_SE1_DIFF1_Val << ADC_CGR_GAIN15_Pos) /* (ADC_CGR) Single-ended gain = 1 (ADC_COR.DIFFx = 0), differential gain = 1 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN15_SE2_DIFF2              (ADC_CGR_GAIN15_SE2_DIFF2_Val << ADC_CGR_GAIN15_Pos) /* (ADC_CGR) Single-ended gain = 2 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_GAIN15_SE4_DIFF2              (ADC_CGR_GAIN15_SE4_DIFF2_Val << ADC_CGR_GAIN15_Pos) /* (ADC_CGR) Single-ended gain = 4 (ADC_COR.DIFFx = 0), differential gain = 2 (ADC_COR.DIFFx = 1) Position  */
#define ADC_CGR_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (ADC_CGR) Register Mask  */


