Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/adc.h
/* -------- ADC_COR : (ADC Offset: 0x4C) (R/W 32) Channel Offset Register -------- */
#define ADC_COR_OFFSET0_Pos                   _UINT32_(0)                                          /* (ADC_COR)  Position */
#define ADC_COR_OFFSET0_Msk                   (_UINT32_(0x1) << ADC_COR_OFFSET0_Pos)               /* (ADC_COR)  Mask */
#define ADC_COR_OFFSET0(value)                (ADC_COR_OFFSET0_Msk & (_UINT32_(value) << ADC_COR_OFFSET0_Pos)) /* Assigment of value for OFFSET0 in the ADC_COR register */
#define ADC_COR_OFFSET1_Pos                   _UINT32_(1)                                          /* (ADC_COR)  Position */
#define ADC_COR_OFFSET1_Msk                   (_UINT32_(0x1) << ADC_COR_OFFSET1_Pos)               /* (ADC_COR)  Mask */
#define ADC_COR_OFFSET1(value)                (ADC_COR_OFFSET1_Msk & (_UINT32_(value) << ADC_COR_OFFSET1_Pos)) /* Assigment of value for OFFSET1 in the ADC_COR register */
#define ADC_COR_OFFSET2_Pos                   _UINT32_(2)                                          /* (ADC_COR)  Position */
#define ADC_COR_OFFSET2_Msk                   (_UINT32_(0x1) << ADC_COR_OFFSET2_Pos)               /* (ADC_COR)  Mask */
#define ADC_COR_OFFSET2(value)                (ADC_COR_OFFSET2_Msk & (_UINT32_(value) << ADC_COR_OFFSET2_Pos)) /* Assigment of value for OFFSET2 in the ADC_COR register */
#define ADC_COR_OFFSET3_Pos                   _UINT32_(3)                                          /* (ADC_COR)  Position */
#define ADC_COR_OFFSET3_Msk                   (_UINT32_(0x1) << ADC_COR_OFFSET3_Pos)               /* (ADC_COR)  Mask */
#define ADC_COR_OFFSET3(value)                (ADC_COR_OFFSET3_Msk & (_UINT32_(value) << ADC_COR_OFFSET3_Pos)) /* Assigment of value for OFFSET3 in the ADC_COR register */
#define ADC_COR_OFFSET4_Pos                   _UINT32_(4)                                          /* (ADC_COR)  Position */
#define ADC_COR_OFFSET4_Msk                   (_UINT32_(0x1) << ADC_COR_OFFSET4_Pos)               /* (ADC_COR)  Mask */
#define ADC_COR_OFFSET4(value)                (ADC_COR_OFFSET4_Msk & (_UINT32_(value) << ADC_COR_OFFSET4_Pos)) /* Assigment of value for OFFSET4 in the ADC_COR register */
#define ADC_COR_OFFSET5_Pos                   _UINT32_(5)                                          /* (ADC_COR)  Position */
#define ADC_COR_OFFSET5_Msk                   (_UINT32_(0x1) << ADC_COR_OFFSET5_Pos)               /* (ADC_COR)  Mask */
#define ADC_COR_OFFSET5(value)                (ADC_COR_OFFSET5_Msk & (_UINT32_(value) << ADC_COR_OFFSET5_Pos)) /* Assigment of value for OFFSET5 in the ADC_COR register */
#define ADC_COR_OFFSET6_Pos                   _UINT32_(6)                                          /* (ADC_COR)  Position */
#define ADC_COR_OFFSET6_Msk                   (_UINT32_(0x1) << ADC_COR_OFFSET6_Pos)               /* (ADC_COR)  Mask */
#define ADC_COR_OFFSET6(value)                (ADC_COR_OFFSET6_Msk & (_UINT32_(value) << ADC_COR_OFFSET6_Pos)) /* Assigment of value for OFFSET6 in the ADC_COR register */
#define ADC_COR_OFFSET7_Pos                   _UINT32_(7)                                          /* (ADC_COR)  Position */
#define ADC_COR_OFFSET7_Msk                   (_UINT32_(0x1) << ADC_COR_OFFSET7_Pos)               /* (ADC_COR)  Mask */
#define ADC_COR_OFFSET7(value)                (ADC_COR_OFFSET7_Msk & (_UINT32_(value) << ADC_COR_OFFSET7_Pos)) /* Assigment of value for OFFSET7 in the ADC_COR register */
#define ADC_COR_OFFSET8_Pos                   _UINT32_(8)                                          /* (ADC_COR)  Position */
#define ADC_COR_OFFSET8_Msk                   (_UINT32_(0x1) << ADC_COR_OFFSET8_Pos)               /* (ADC_COR)  Mask */
#define ADC_COR_OFFSET8(value)                (ADC_COR_OFFSET8_Msk & (_UINT32_(value) << ADC_COR_OFFSET8_Pos)) /* Assigment of value for OFFSET8 in the ADC_COR register */
#define ADC_COR_OFFSET9_Pos                   _UINT32_(9)                                          /* (ADC_COR)  Position */
#define ADC_COR_OFFSET9_Msk                   (_UINT32_(0x1) << ADC_COR_OFFSET9_Pos)               /* (ADC_COR)  Mask */
#define ADC_COR_OFFSET9(value)                (ADC_COR_OFFSET9_Msk & (_UINT32_(value) << ADC_COR_OFFSET9_Pos)) /* Assigment of value for OFFSET9 in the ADC_COR register */
#define ADC_COR_OFFSET10_Pos                  _UINT32_(10)                                         /* (ADC_COR)  Position */
#define ADC_COR_OFFSET10_Msk                  (_UINT32_(0x1) << ADC_COR_OFFSET10_Pos)              /* (ADC_COR)  Mask */
#define ADC_COR_OFFSET10(value)               (ADC_COR_OFFSET10_Msk & (_UINT32_(value) << ADC_COR_OFFSET10_Pos)) /* Assigment of value for OFFSET10 in the ADC_COR register */
#define ADC_COR_OFFSET11_Pos                  _UINT32_(11)                                         /* (ADC_COR)  Position */
#define ADC_COR_OFFSET11_Msk                  (_UINT32_(0x1) << ADC_COR_OFFSET11_Pos)              /* (ADC_COR)  Mask */
#define ADC_COR_OFFSET11(value)               (ADC_COR_OFFSET11_Msk & (_UINT32_(value) << ADC_COR_OFFSET11_Pos)) /* Assigment of value for OFFSET11 in the ADC_COR register */
#define ADC_COR_OFFSET12_Pos                  _UINT32_(12)                                         /* (ADC_COR)  Position */
#define ADC_COR_OFFSET12_Msk                  (_UINT32_(0x1) << ADC_COR_OFFSET12_Pos)              /* (ADC_COR)  Mask */
#define ADC_COR_OFFSET12(value)               (ADC_COR_OFFSET12_Msk & (_UINT32_(value) << ADC_COR_OFFSET12_Pos)) /* Assigment of value for OFFSET12 in the ADC_COR register */
#define ADC_COR_OFFSET13_Pos                  _UINT32_(13)                                         /* (ADC_COR)  Position */
#define ADC_COR_OFFSET13_Msk                  (_UINT32_(0x1) << ADC_COR_OFFSET13_Pos)              /* (ADC_COR)  Mask */
#define ADC_COR_OFFSET13(value)               (ADC_COR_OFFSET13_Msk & (_UINT32_(value) << ADC_COR_OFFSET13_Pos)) /* Assigment of value for OFFSET13 in the ADC_COR register */
#define ADC_COR_OFFSET14_Pos                  _UINT32_(14)                                         /* (ADC_COR)  Position */
#define ADC_COR_OFFSET14_Msk                  (_UINT32_(0x1) << ADC_COR_OFFSET14_Pos)              /* (ADC_COR)  Mask */
#define ADC_COR_OFFSET14(value)               (ADC_COR_OFFSET14_Msk & (_UINT32_(value) << ADC_COR_OFFSET14_Pos)) /* Assigment of value for OFFSET14 in the ADC_COR register */
#define ADC_COR_OFFSET15_Pos                  _UINT32_(15)                                         /* (ADC_COR)  Position */
#define ADC_COR_OFFSET15_Msk                  (_UINT32_(0x1) << ADC_COR_OFFSET15_Pos)              /* (ADC_COR)  Mask */
#define ADC_COR_OFFSET15(value)               (ADC_COR_OFFSET15_Msk & (_UINT32_(value) << ADC_COR_OFFSET15_Pos)) /* Assigment of value for OFFSET15 in the ADC_COR register */
#define ADC_COR_DIFF0_Pos                     _UINT32_(16)                                         /* (ADC_COR) Differential Inputs for Channel 0 Position */
#define ADC_COR_DIFF0_Msk                     (_UINT32_(0x1) << ADC_COR_DIFF0_Pos)                 /* (ADC_COR) Differential Inputs for Channel 0 Mask */
#define ADC_COR_DIFF0(value)                  (ADC_COR_DIFF0_Msk & (_UINT32_(value) << ADC_COR_DIFF0_Pos)) /* Assigment of value for DIFF0 in the ADC_COR register */
#define ADC_COR_DIFF1_Pos                     _UINT32_(17)                                         /* (ADC_COR) Differential Inputs for Channel 1 Position */
#define ADC_COR_DIFF1_Msk                     (_UINT32_(0x1) << ADC_COR_DIFF1_Pos)                 /* (ADC_COR) Differential Inputs for Channel 1 Mask */
#define ADC_COR_DIFF1(value)                  (ADC_COR_DIFF1_Msk & (_UINT32_(value) << ADC_COR_DIFF1_Pos)) /* Assigment of value for DIFF1 in the ADC_COR register */
#define ADC_COR_DIFF2_Pos                     _UINT32_(18)                                         /* (ADC_COR) Differential Inputs for Channel 2 Position */
#define ADC_COR_DIFF2_Msk                     (_UINT32_(0x1) << ADC_COR_DIFF2_Pos)                 /* (ADC_COR) Differential Inputs for Channel 2 Mask */
#define ADC_COR_DIFF2(value)                  (ADC_COR_DIFF2_Msk & (_UINT32_(value) << ADC_COR_DIFF2_Pos)) /* Assigment of value for DIFF2 in the ADC_COR register */
#define ADC_COR_DIFF3_Pos                     _UINT32_(19)                                         /* (ADC_COR) Differential Inputs for Channel 3 Position */
#define ADC_COR_DIFF3_Msk                     (_UINT32_(0x1) << ADC_COR_DIFF3_Pos)                 /* (ADC_COR) Differential Inputs for Channel 3 Mask */
#define ADC_COR_DIFF3(value)                  (ADC_COR_DIFF3_Msk & (_UINT32_(value) << ADC_COR_DIFF3_Pos)) /* Assigment of value for DIFF3 in the ADC_COR register */
#define ADC_COR_DIFF4_Pos                     _UINT32_(20)                                         /* (ADC_COR) Differential Inputs for Channel 4 Position */
#define ADC_COR_DIFF4_Msk                     (_UINT32_(0x1) << ADC_COR_DIFF4_Pos)                 /* (ADC_COR) Differential Inputs for Channel 4 Mask */
#define ADC_COR_DIFF4(value)                  (ADC_COR_DIFF4_Msk & (_UINT32_(value) << ADC_COR_DIFF4_Pos)) /* Assigment of value for DIFF4 in the ADC_COR register */
#define ADC_COR_DIFF5_Pos                     _UINT32_(21)                                         /* (ADC_COR) Differential Inputs for Channel 5 Position */
#define ADC_COR_DIFF5_Msk                     (_UINT32_(0x1) << ADC_COR_DIFF5_Pos)                 /* (ADC_COR) Differential Inputs for Channel 5 Mask */
#define ADC_COR_DIFF5(value)                  (ADC_COR_DIFF5_Msk & (_UINT32_(value) << ADC_COR_DIFF5_Pos)) /* Assigment of value for DIFF5 in the ADC_COR register */
#define ADC_COR_DIFF6_Pos                     _UINT32_(22)                                         /* (ADC_COR) Differential Inputs for Channel 6 Position */
#define ADC_COR_DIFF6_Msk                     (_UINT32_(0x1) << ADC_COR_DIFF6_Pos)                 /* (ADC_COR) Differential Inputs for Channel 6 Mask */
#define ADC_COR_DIFF6(value)                  (ADC_COR_DIFF6_Msk & (_UINT32_(value) << ADC_COR_DIFF6_Pos)) /* Assigment of value for DIFF6 in the ADC_COR register */
#define ADC_COR_DIFF7_Pos                     _UINT32_(23)                                         /* (ADC_COR) Differential Inputs for Channel 7 Position */
#define ADC_COR_DIFF7_Msk                     (_UINT32_(0x1) << ADC_COR_DIFF7_Pos)                 /* (ADC_COR) Differential Inputs for Channel 7 Mask */
#define ADC_COR_DIFF7(value)                  (ADC_COR_DIFF7_Msk & (_UINT32_(value) << ADC_COR_DIFF7_Pos)) /* Assigment of value for DIFF7 in the ADC_COR register */
#define ADC_COR_DIFF8_Pos                     _UINT32_(24)                                         /* (ADC_COR) Differential Inputs for Channel 8 Position */
#define ADC_COR_DIFF8_Msk                     (_UINT32_(0x1) << ADC_COR_DIFF8_Pos)                 /* (ADC_COR) Differential Inputs for Channel 8 Mask */
#define ADC_COR_DIFF8(value)                  (ADC_COR_DIFF8_Msk & (_UINT32_(value) << ADC_COR_DIFF8_Pos)) /* Assigment of value for DIFF8 in the ADC_COR register */
#define ADC_COR_DIFF9_Pos                     _UINT32_(25)                                         /* (ADC_COR) Differential Inputs for Channel 9 Position */
#define ADC_COR_DIFF9_Msk                     (_UINT32_(0x1) << ADC_COR_DIFF9_Pos)                 /* (ADC_COR) Differential Inputs for Channel 9 Mask */
#define ADC_COR_DIFF9(value)                  (ADC_COR_DIFF9_Msk & (_UINT32_(value) << ADC_COR_DIFF9_Pos)) /* Assigment of value for DIFF9 in the ADC_COR register */
#define ADC_COR_DIFF10_Pos                    _UINT32_(26)                                         /* (ADC_COR) Differential Inputs for Channel 10 Position */
#define ADC_COR_DIFF10_Msk                    (_UINT32_(0x1) << ADC_COR_DIFF10_Pos)                /* (ADC_COR) Differential Inputs for Channel 10 Mask */
#define ADC_COR_DIFF10(value)                 (ADC_COR_DIFF10_Msk & (_UINT32_(value) << ADC_COR_DIFF10_Pos)) /* Assigment of value for DIFF10 in the ADC_COR register */
#define ADC_COR_DIFF11_Pos                    _UINT32_(27)                                         /* (ADC_COR) Differential Inputs for Channel 11 Position */
#define ADC_COR_DIFF11_Msk                    (_UINT32_(0x1) << ADC_COR_DIFF11_Pos)                /* (ADC_COR) Differential Inputs for Channel 11 Mask */
#define ADC_COR_DIFF11(value)                 (ADC_COR_DIFF11_Msk & (_UINT32_(value) << ADC_COR_DIFF11_Pos)) /* Assigment of value for DIFF11 in the ADC_COR register */
#define ADC_COR_DIFF12_Pos                    _UINT32_(28)                                         /* (ADC_COR) Differential Inputs for Channel 12 Position */
#define ADC_COR_DIFF12_Msk                    (_UINT32_(0x1) << ADC_COR_DIFF12_Pos)                /* (ADC_COR) Differential Inputs for Channel 12 Mask */
#define ADC_COR_DIFF12(value)                 (ADC_COR_DIFF12_Msk & (_UINT32_(value) << ADC_COR_DIFF12_Pos)) /* Assigment of value for DIFF12 in the ADC_COR register */
#define ADC_COR_DIFF13_Pos                    _UINT32_(29)                                         /* (ADC_COR) Differential Inputs for Channel 13 Position */
#define ADC_COR_DIFF13_Msk                    (_UINT32_(0x1) << ADC_COR_DIFF13_Pos)                /* (ADC_COR) Differential Inputs for Channel 13 Mask */
#define ADC_COR_DIFF13(value)                 (ADC_COR_DIFF13_Msk & (_UINT32_(value) << ADC_COR_DIFF13_Pos)) /* Assigment of value for DIFF13 in the ADC_COR register */
#define ADC_COR_DIFF14_Pos                    _UINT32_(30)                                         /* (ADC_COR) Differential Inputs for Channel 14 Position */
#define ADC_COR_DIFF14_Msk                    (_UINT32_(0x1) << ADC_COR_DIFF14_Pos)                /* (ADC_COR) Differential Inputs for Channel 14 Mask */
#define ADC_COR_DIFF14(value)                 (ADC_COR_DIFF14_Msk & (_UINT32_(value) << ADC_COR_DIFF14_Pos)) /* Assigment of value for DIFF14 in the ADC_COR register */
#define ADC_COR_DIFF15_Pos                    _UINT32_(31)                                         /* (ADC_COR) Differential Inputs for Channel 15 Position */
#define ADC_COR_DIFF15_Msk                    (_UINT32_(0x1) << ADC_COR_DIFF15_Pos)                /* (ADC_COR) Differential Inputs for Channel 15 Mask */
#define ADC_COR_DIFF15(value)                 (ADC_COR_DIFF15_Msk & (_UINT32_(value) << ADC_COR_DIFF15_Pos)) /* Assigment of value for DIFF15 in the ADC_COR register */
#define ADC_COR_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (ADC_COR) Register Mask  */

