Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/adc.h
#define ADC_COR_OFFSET_Pos                    _UINT32_(0)                                          /* (ADC_COR Position)  */
#define ADC_COR_OFFSET_Msk                    (_UINT32_(0xFFFF) << ADC_COR_OFFSET_Pos)             /* (ADC_COR Mask) OFFSET */
#define ADC_COR_OFFSET(value)                 (ADC_COR_OFFSET_Msk & (_UINT32_(value) << ADC_COR_OFFSET_Pos)) 
#define ADC_COR_DIFF_Pos                      _UINT32_(16)                                         /* (ADC_COR Position) Differential Inputs for Channel x5 */
#define ADC_COR_DIFF_Msk                      (_UINT32_(0xFFFF) << ADC_COR_DIFF_Pos)               /* (ADC_COR Mask) DIFF */
#define ADC_COR_DIFF(value)                   (ADC_COR_DIFF_Msk & (_UINT32_(value) << ADC_COR_DIFF_Pos)) 

/* -------- ADC_CDR : (ADC Offset: 0x50) ( R/ 32) Channel Data Register -------- */
#define ADC_CDR_DATA_Pos                      _UINT32_(0)                                          /* (ADC_CDR) Converted Data Position */
#define ADC_CDR_DATA_Msk                      (_UINT32_(0xFFFF) << ADC_CDR_DATA_Pos)               /* (ADC_CDR) Converted Data Mask */
#define ADC_CDR_DATA(value)                   (ADC_CDR_DATA_Msk & (_UINT32_(value) << ADC_CDR_DATA_Pos)) /* Assigment of value for DATA in the ADC_CDR register */
#define ADC_CDR_Msk                           _UINT32_(0x0000FFFF)                                 /* (ADC_CDR) Register Mask  */


/* -------- ADC_ACR : (ADC Offset: 0x94) (R/W 32) Analog Control Register -------- */
#define ADC_ACR_IBCTL_Pos                     _UINT32_(8)                                          /* (ADC_ACR) ADC Bias Current Control Position */
#define ADC_ACR_IBCTL_Msk                     (_UINT32_(0x3) << ADC_ACR_IBCTL_Pos)                 /* (ADC_ACR) ADC Bias Current Control Mask */
#define ADC_ACR_IBCTL(value)                  (ADC_ACR_IBCTL_Msk & (_UINT32_(value) << ADC_ACR_IBCTL_Pos)) /* Assigment of value for IBCTL in the ADC_ACR register */
#define ADC_ACR_Msk                           _UINT32_(0x00000300)                                 /* (ADC_ACR) Register Mask  */


/* -------- ADC_CVR : (ADC Offset: 0xD4) (R/W 32) Correction Values Register -------- */
#define ADC_CVR_OFFSETCORR_Pos                _UINT32_(0)                                          /* (ADC_CVR) Offset Correction Position */
#define ADC_CVR_OFFSETCORR_Msk                (_UINT32_(0xFFFF) << ADC_CVR_OFFSETCORR_Pos)         /* (ADC_CVR) Offset Correction Mask */
#define ADC_CVR_OFFSETCORR(value)             (ADC_CVR_OFFSETCORR_Msk & (_UINT32_(value) << ADC_CVR_OFFSETCORR_Pos)) /* Assigment of value for OFFSETCORR in the ADC_CVR register */
#define ADC_CVR_GAINCORR_Pos                  _UINT32_(16)                                         /* (ADC_CVR) Gain Correction Position */
#define ADC_CVR_GAINCORR_Msk                  (_UINT32_(0xFFFF) << ADC_CVR_GAINCORR_Pos)           /* (ADC_CVR) Gain Correction Mask */
#define ADC_CVR_GAINCORR(value)               (ADC_CVR_GAINCORR_Msk & (_UINT32_(value) << ADC_CVR_GAINCORR_Pos)) /* Assigment of value for GAINCORR in the ADC_CVR register */
#define ADC_CVR_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (ADC_CVR) Register Mask  */


/* -------- ADC_CECR : (ADC Offset: 0xD8) (R/W 32) Channel Error Correction Register -------- */
#define ADC_CECR_ECORR0_Pos                   _UINT32_(0)                                          /* (ADC_CECR) Error Correction Enable for channel 0 Position */
#define ADC_CECR_ECORR0_Msk                   (_UINT32_(0x1) << ADC_CECR_ECORR0_Pos)               /* (ADC_CECR) Error Correction Enable for channel 0 Mask */
#define ADC_CECR_ECORR0(value)                (ADC_CECR_ECORR0_Msk & (_UINT32_(value) << ADC_CECR_ECORR0_Pos)) /* Assigment of value for ECORR0 in the ADC_CECR register */
#define ADC_CECR_ECORR1_Pos                   _UINT32_(1)                                          /* (ADC_CECR) Error Correction Enable for channel 1 Position */
#define ADC_CECR_ECORR1_Msk                   (_UINT32_(0x1) << ADC_CECR_ECORR1_Pos)               /* (ADC_CECR) Error Correction Enable for channel 1 Mask */
#define ADC_CECR_ECORR1(value)                (ADC_CECR_ECORR1_Msk & (_UINT32_(value) << ADC_CECR_ECORR1_Pos)) /* Assigment of value for ECORR1 in the ADC_CECR register */
#define ADC_CECR_ECORR2_Pos                   _UINT32_(2)                                          /* (ADC_CECR) Error Correction Enable for channel 2 Position */
#define ADC_CECR_ECORR2_Msk                   (_UINT32_(0x1) << ADC_CECR_ECORR2_Pos)               /* (ADC_CECR) Error Correction Enable for channel 2 Mask */
#define ADC_CECR_ECORR2(value)                (ADC_CECR_ECORR2_Msk & (_UINT32_(value) << ADC_CECR_ECORR2_Pos)) /* Assigment of value for ECORR2 in the ADC_CECR register */
#define ADC_CECR_ECORR3_Pos                   _UINT32_(3)                                          /* (ADC_CECR) Error Correction Enable for channel 3 Position */
#define ADC_CECR_ECORR3_Msk                   (_UINT32_(0x1) << ADC_CECR_ECORR3_Pos)               /* (ADC_CECR) Error Correction Enable for channel 3 Mask */
#define ADC_CECR_ECORR3(value)                (ADC_CECR_ECORR3_Msk & (_UINT32_(value) << ADC_CECR_ECORR3_Pos)) /* Assigment of value for ECORR3 in the ADC_CECR register */
#define ADC_CECR_ECORR4_Pos                   _UINT32_(4)                                          /* (ADC_CECR) Error Correction Enable for channel 4 Position */
#define ADC_CECR_ECORR4_Msk                   (_UINT32_(0x1) << ADC_CECR_ECORR4_Pos)               /* (ADC_CECR) Error Correction Enable for channel 4 Mask */
#define ADC_CECR_ECORR4(value)                (ADC_CECR_ECORR4_Msk & (_UINT32_(value) << ADC_CECR_ECORR4_Pos)) /* Assigment of value for ECORR4 in the ADC_CECR register */
#define ADC_CECR_ECORR5_Pos                   _UINT32_(5)                                          /* (ADC_CECR) Error Correction Enable for channel 5 Position */
#define ADC_CECR_ECORR5_Msk                   (_UINT32_(0x1) << ADC_CECR_ECORR5_Pos)               /* (ADC_CECR) Error Correction Enable for channel 5 Mask */
#define ADC_CECR_ECORR5(value)                (ADC_CECR_ECORR5_Msk & (_UINT32_(value) << ADC_CECR_ECORR5_Pos)) /* Assigment of value for ECORR5 in the ADC_CECR register */
#define ADC_CECR_ECORR6_Pos                   _UINT32_(6)                                          /* (ADC_CECR) Error Correction Enable for channel 6 Position */
#define ADC_CECR_ECORR6_Msk                   (_UINT32_(0x1) << ADC_CECR_ECORR6_Pos)               /* (ADC_CECR) Error Correction Enable for channel 6 Mask */
#define ADC_CECR_ECORR6(value)                (ADC_CECR_ECORR6_Msk & (_UINT32_(value) << ADC_CECR_ECORR6_Pos)) /* Assigment of value for ECORR6 in the ADC_CECR register */
#define ADC_CECR_ECORR7_Pos                   _UINT32_(7)                                          /* (ADC_CECR) Error Correction Enable for channel 7 Position */
#define ADC_CECR_ECORR7_Msk                   (_UINT32_(0x1) << ADC_CECR_ECORR7_Pos)               /* (ADC_CECR) Error Correction Enable for channel 7 Mask */
#define ADC_CECR_ECORR7(value)                (ADC_CECR_ECORR7_Msk & (_UINT32_(value) << ADC_CECR_ECORR7_Pos)) /* Assigment of value for ECORR7 in the ADC_CECR register */
#define ADC_CECR_ECORR8_Pos                   _UINT32_(8)                                          /* (ADC_CECR) Error Correction Enable for channel 8 Position */
#define ADC_CECR_ECORR8_Msk                   (_UINT32_(0x1) << ADC_CECR_ECORR8_Pos)               /* (ADC_CECR) Error Correction Enable for channel 8 Mask */
#define ADC_CECR_ECORR8(value)                (ADC_CECR_ECORR8_Msk & (_UINT32_(value) << ADC_CECR_ECORR8_Pos)) /* Assigment of value for ECORR8 in the ADC_CECR register */
#define ADC_CECR_ECORR9_Pos                   _UINT32_(9)                                          /* (ADC_CECR) Error Correction Enable for channel 9 Position */
#define ADC_CECR_ECORR9_Msk                   (_UINT32_(0x1) << ADC_CECR_ECORR9_Pos)               /* (ADC_CECR) Error Correction Enable for channel 9 Mask */
#define ADC_CECR_ECORR9(value)                (ADC_CECR_ECORR9_Msk & (_UINT32_(value) << ADC_CECR_ECORR9_Pos)) /* Assigment of value for ECORR9 in the ADC_CECR register */
#define ADC_CECR_ECORR10_Pos                  _UINT32_(10)                                         /* (ADC_CECR) Error Correction Enable for channel 10 Position */
#define ADC_CECR_ECORR10_Msk                  (_UINT32_(0x1) << ADC_CECR_ECORR10_Pos)              /* (ADC_CECR) Error Correction Enable for channel 10 Mask */
#define ADC_CECR_ECORR10(value)               (ADC_CECR_ECORR10_Msk & (_UINT32_(value) << ADC_CECR_ECORR10_Pos)) /* Assigment of value for ECORR10 in the ADC_CECR register */
#define ADC_CECR_ECORR11_Pos                  _UINT32_(11)                                         /* (ADC_CECR) Error Correction Enable for channel 11 Position */
#define ADC_CECR_ECORR11_Msk                  (_UINT32_(0x1) << ADC_CECR_ECORR11_Pos)              /* (ADC_CECR) Error Correction Enable for channel 11 Mask */
#define ADC_CECR_ECORR11(value)               (ADC_CECR_ECORR11_Msk & (_UINT32_(value) << ADC_CECR_ECORR11_Pos)) /* Assigment of value for ECORR11 in the ADC_CECR register */
#define ADC_CECR_ECORR12_Pos                  _UINT32_(12)                                         /* (ADC_CECR) Error Correction Enable for channel 12 Position */
#define ADC_CECR_ECORR12_Msk                  (_UINT32_(0x1) << ADC_CECR_ECORR12_Pos)              /* (ADC_CECR) Error Correction Enable for channel 12 Mask */
#define ADC_CECR_ECORR12(value)               (ADC_CECR_ECORR12_Msk & (_UINT32_(value) << ADC_CECR_ECORR12_Pos)) /* Assigment of value for ECORR12 in the ADC_CECR register */
#define ADC_CECR_ECORR13_Pos                  _UINT32_(13)                                         /* (ADC_CECR) Error Correction Enable for channel 13 Position */
#define ADC_CECR_ECORR13_Msk                  (_UINT32_(0x1) << ADC_CECR_ECORR13_Pos)              /* (ADC_CECR) Error Correction Enable for channel 13 Mask */
#define ADC_CECR_ECORR13(value)               (ADC_CECR_ECORR13_Msk & (_UINT32_(value) << ADC_CECR_ECORR13_Pos)) /* Assigment of value for ECORR13 in the ADC_CECR register */
#define ADC_CECR_ECORR14_Pos                  _UINT32_(14)                                         /* (ADC_CECR) Error Correction Enable for channel 14 Position */
#define ADC_CECR_ECORR14_Msk                  (_UINT32_(0x1) << ADC_CECR_ECORR14_Pos)              /* (ADC_CECR) Error Correction Enable for channel 14 Mask */
#define ADC_CECR_ECORR14(value)               (ADC_CECR_ECORR14_Msk & (_UINT32_(value) << ADC_CECR_ECORR14_Pos)) /* Assigment of value for ECORR14 in the ADC_CECR register */
#define ADC_CECR_ECORR15_Pos                  _UINT32_(15)                                         /* (ADC_CECR) Error Correction Enable for channel 15 Position */
#define ADC_CECR_ECORR15_Msk                  (_UINT32_(0x1) << ADC_CECR_ECORR15_Pos)              /* (ADC_CECR) Error Correction Enable for channel 15 Mask */
#define ADC_CECR_ECORR15(value)               (ADC_CECR_ECORR15_Msk & (_UINT32_(value) << ADC_CECR_ECORR15_Pos)) /* Assigment of value for ECORR15 in the ADC_CECR register */
#define ADC_CECR_Msk                          _UINT32_(0x0000FFFF)                                 /* (ADC_CECR) Register Mask  */

#define ADC_CECR_ECORR_Pos                    _UINT32_(0)                                          /* (ADC_CECR Position) Error Correction Enable for channel x5 */
#define ADC_CECR_ECORR_Msk                    (_UINT32_(0xFFFF) << ADC_CECR_ECORR_Pos)             /* (ADC_CECR Mask) ECORR */
#define ADC_CECR_ECORR(value)                 (ADC_CECR_ECORR_Msk & (_UINT32_(value) << ADC_CECR_ECORR_Pos)) 

/* -------- ADC_WPMR : (ADC Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define ADC_WPMR_WPEN_Pos                     _UINT32_(0)                                          /* (ADC_WPMR) Write Protection Enable Position */
#define ADC_WPMR_WPEN_Msk                     (_UINT32_(0x1) << ADC_WPMR_WPEN_Pos)                 /* (ADC_WPMR) Write Protection Enable Mask */
#define ADC_WPMR_WPEN(value)                  (ADC_WPMR_WPEN_Msk & (_UINT32_(value) << ADC_WPMR_WPEN_Pos)) /* Assigment of value for WPEN in the ADC_WPMR register */
#define ADC_WPMR_WPITEN_Pos                   _UINT32_(1)                                          /* (ADC_WPMR) Write Protection Interrupt Enable Position */
#define ADC_WPMR_WPITEN_Msk                   (_UINT32_(0x1) << ADC_WPMR_WPITEN_Pos)               /* (ADC_WPMR) Write Protection Interrupt Enable Mask */
#define ADC_WPMR_WPITEN(value)                (ADC_WPMR_WPITEN_Msk & (_UINT32_(value) << ADC_WPMR_WPITEN_Pos)) /* Assigment of value for WPITEN in the ADC_WPMR register */
#define ADC_WPMR_WPCTEN_Pos                   _UINT32_(2)                                          /* (ADC_WPMR) Write Protection Control Enable Position */
#define ADC_WPMR_WPCTEN_Msk                   (_UINT32_(0x1) << ADC_WPMR_WPCTEN_Pos)               /* (ADC_WPMR) Write Protection Control Enable Mask */
#define ADC_WPMR_WPCTEN(value)                (ADC_WPMR_WPCTEN_Msk & (_UINT32_(value) << ADC_WPMR_WPCTEN_Pos)) /* Assigment of value for WPCTEN in the ADC_WPMR register */
#define ADC_WPMR_WPKEY_Pos                    _UINT32_(8)                                          /* (ADC_WPMR) Write Protection Key Position */
#define ADC_WPMR_WPKEY_Msk                    (_UINT32_(0xFFFFFF) << ADC_WPMR_WPKEY_Pos)           /* (ADC_WPMR) Write Protection Key Mask */
#define ADC_WPMR_WPKEY(value)                 (ADC_WPMR_WPKEY_Msk & (_UINT32_(value) << ADC_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the ADC_WPMR register */
#define   ADC_WPMR_WPKEY_PASSWD_Val           _UINT32_(0x414443)                                   /* (ADC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0  */
#define ADC_WPMR_WPKEY_PASSWD                 (ADC_WPMR_WPKEY_PASSWD_Val << ADC_WPMR_WPKEY_Pos)    /* (ADC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0 Position  */
#define ADC_WPMR_Msk                          _UINT32_(0xFFFFFF07)                                 /* (ADC_WPMR) Register Mask  */


/* -------- ADC_WPSR : (ADC Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define ADC_WPSR_WPVS_Pos                     _UINT32_(0)                                          /* (ADC_WPSR) Write Protection Violation Status Position */
#define ADC_WPSR_WPVS_Msk                     (_UINT32_(0x1) << ADC_WPSR_WPVS_Pos)                 /* (ADC_WPSR) Write Protection Violation Status Mask */
#define ADC_WPSR_WPVS(value)                  (ADC_WPSR_WPVS_Msk & (_UINT32_(value) << ADC_WPSR_WPVS_Pos)) /* Assigment of value for WPVS in the ADC_WPSR register */
#define ADC_WPSR_WPVSRC_Pos                   _UINT32_(8)                                          /* (ADC_WPSR) Write Protection Violation Source Position */
#define ADC_WPSR_WPVSRC_Msk                   (_UINT32_(0xFFFF) << ADC_WPSR_WPVSRC_Pos)            /* (ADC_WPSR) Write Protection Violation Source Mask */
#define ADC_WPSR_WPVSRC(value)                (ADC_WPSR_WPVSRC_Msk & (_UINT32_(value) << ADC_WPSR_WPVSRC_Pos)) /* Assigment of value for WPVSRC in the ADC_WPSR register */
#define ADC_WPSR_Msk                          _UINT32_(0x00FFFF01)                                 /* (ADC_WPSR) Register Mask  */


/** \brief ADC register offsets definitions */
#define ADC_CR_REG_OFST                _UINT32_(0x00)      /* (ADC_CR) Control Register Offset */
#define ADC_MR_REG_OFST                _UINT32_(0x04)      /* (ADC_MR) Mode Register Offset */
#define ADC_SEQR1_REG_OFST             _UINT32_(0x08)      /* (ADC_SEQR1) Channel Sequence Register 1 Offset */
#define ADC_SEQR2_REG_OFST             _UINT32_(0x0C)      /* (ADC_SEQR2) Channel Sequence Register 2 Offset */
#define ADC_CHER_REG_OFST              _UINT32_(0x10)      /* (ADC_CHER) Channel Enable Register Offset */
#define ADC_CHDR_REG_OFST              _UINT32_(0x14)      /* (ADC_CHDR) Channel Disable Register Offset */
#define ADC_CHSR_REG_OFST              _UINT32_(0x18)      /* (ADC_CHSR) Channel Status Register Offset */
#define ADC_LCDR_REG_OFST              _UINT32_(0x20)      /* (ADC_LCDR) Last Converted Data Register Offset */
#define ADC_IER_REG_OFST               _UINT32_(0x24)      /* (ADC_IER) Interrupt Enable Register Offset */
#define ADC_IDR_REG_OFST               _UINT32_(0x28)      /* (ADC_IDR) Interrupt Disable Register Offset */
#define ADC_IMR_REG_OFST               _UINT32_(0x2C)      /* (ADC_IMR) Interrupt Mask Register Offset */
#define ADC_ISR_REG_OFST               _UINT32_(0x30)      /* (ADC_ISR) Interrupt Status Register Offset */
#define ADC_OVER_REG_OFST              _UINT32_(0x3C)      /* (ADC_OVER) Overrun Status Register Offset */
#define ADC_EMR_REG_OFST               _UINT32_(0x40)      /* (ADC_EMR) Extended Mode Register Offset */
#define ADC_CWR_REG_OFST               _UINT32_(0x44)      /* (ADC_CWR) Compare Window Register Offset */
#define ADC_CGR_REG_OFST               _UINT32_(0x48)      /* (ADC_CGR) Channel Gain Register Offset */
#define ADC_COR_REG_OFST               _UINT32_(0x4C)      /* (ADC_COR) Channel Offset Register Offset */
#define ADC_CDR_REG_OFST               _UINT32_(0x50)      /* (ADC_CDR) Channel Data Register Offset */
#define ADC_CDR0_REG_OFST              _UINT32_(0x50)      /* (ADC_CDR0) Channel Data Register Offset */
#define ADC_CDR1_REG_OFST              _UINT32_(0x54)      /* (ADC_CDR1) Channel Data Register Offset */
#define ADC_CDR2_REG_OFST              _UINT32_(0x58)      /* (ADC_CDR2) Channel Data Register Offset */
#define ADC_CDR3_REG_OFST              _UINT32_(0x5C)      /* (ADC_CDR3) Channel Data Register Offset */
#define ADC_CDR4_REG_OFST              _UINT32_(0x60)      /* (ADC_CDR4) Channel Data Register Offset */
#define ADC_CDR5_REG_OFST              _UINT32_(0x64)      /* (ADC_CDR5) Channel Data Register Offset */
#define ADC_CDR6_REG_OFST              _UINT32_(0x68)      /* (ADC_CDR6) Channel Data Register Offset */
#define ADC_CDR7_REG_OFST              _UINT32_(0x6C)      /* (ADC_CDR7) Channel Data Register Offset */
#define ADC_CDR8_REG_OFST              _UINT32_(0x70)      /* (ADC_CDR8) Channel Data Register Offset */
#define ADC_CDR9_REG_OFST              _UINT32_(0x74)      /* (ADC_CDR9) Channel Data Register Offset */
#define ADC_CDR10_REG_OFST             _UINT32_(0x78)      /* (ADC_CDR10) Channel Data Register Offset */
#define ADC_CDR11_REG_OFST             _UINT32_(0x7C)      /* (ADC_CDR11) Channel Data Register Offset */
#define ADC_CDR12_REG_OFST             _UINT32_(0x80)      /* (ADC_CDR12) Channel Data Register Offset */
#define ADC_CDR13_REG_OFST             _UINT32_(0x84)      /* (ADC_CDR13) Channel Data Register Offset */
#define ADC_CDR14_REG_OFST             _UINT32_(0x88)      /* (ADC_CDR14) Channel Data Register Offset */
#define ADC_CDR15_REG_OFST             _UINT32_(0x8C)      /* (ADC_CDR15) Channel Data Register Offset */
#define ADC_ACR_REG_OFST               _UINT32_(0x94)      /* (ADC_ACR) Analog Control Register Offset */
#define ADC_CVR_REG_OFST               _UINT32_(0xD4)      /* (ADC_CVR) Correction Values Register Offset */
#define ADC_CECR_REG_OFST              _UINT32_(0xD8)      /* (ADC_CECR) Channel Error Correction Register Offset */
#define ADC_WPMR_REG_OFST              _UINT32_(0xE4)      /* (ADC_WPMR) Write Protection Mode Register Offset */
#define ADC_WPSR_REG_OFST              _UINT32_(0xE8)      /* (ADC_WPSR) Write Protection Status Register Offset */

